{
  "generatedAt": "2026-02-05T15:14:27.891Z",
  "day": "2025-08-20",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-08-20",
          "title": "Reading Complete pages 45,47,48 n the MY View Reading Book {tomorrow) Please watch the video if you need help. https:…",
          "details": "Reading Complete pages 45,47,48 n the MY View Reading Book {tomorrow) Please watch the video if you need help. https://www.youtube.com/watch?v=hLASwjg7fQo Complete the AR quiz for grandma and the great gourd. You can log in and search the title, and take the quz. If you are not sure of the story, please read or watch the video again. (FRIDAY) Readworks Assignment 2 The Star Maiden: An Ojibway Legend 1. Have students go to www.readworks.org/student 2. Students enter class code YU6GQ2 3. Tell your students that their default password is 1234 The spelling test words for this Friday are fierce baring flexing crouching swipe hut chores skinny sleek fertilizer gourd dizzy paw drolling lentils Please prepare for the test on Friday Math Complete lesson 1-3 in the math homework book (TOMORROW) Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. If you did not complete your multiplication flower, please have it ready tomorrow. Science For the first lesson in the science book, let's watch the videos about motion and forces. https://www.youtube.com/watch?v=MaTk8SI7g9Q https://www.youtube.com/watch?v=3HjKFOVhm_o Social Studies 📘 Social Studies Project Homework We are starting our first Social Studies project! 🎉 Each student will choose 1 country (not Korea, since we are learning about other countries) and 1 city in that country. They will create a poster on A3 paper that includes the following: Physical Geography – mountains, rivers, lakes, deserts, forests Human Geography – population, celebrations, foods, famous buildings or landmarks Other Important Facts – language, currency, country flag, a map of the country and the city, any other interesting facts you would like to share The poster should be bright, colorful, and creative so we can decorate our classroom with them. Each student will present their poster to the class next week for about 1–2 minutes. ➡️ This project is due next Wednesday. Some videos related to this week's study Continents https://www.youtube.com/watch?v=K6DSMZ8b3LE Oceans https://www.youtube.com/watch?v=X6BE4VcYngQ Countries https://www.youtube.com/watch?v=V1508wboZXk States or the US and capitals https://www.youtube.com/watch?v=bx6c_EefZAQ Readworks Assignment 3 Our world 1. Have students go to www.readworks.org/student 2. Students enter class code YU6GQ2 3. Tell your students that their default password is 1234",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-08-20T08:25:32.157Z"
        }
      ]
    }
  ]
}