{
  "generatedAt": "2026-02-05T15:14:27.893Z",
  "day": "2025-09-02",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-09-02",
          "title": "Reading Complete the definition paper. Please use your own words, not long definitions from the dictionary. (Due TOMO…",
          "details": "Reading Complete the definition paper. Please use your own words, not long definitions from the dictionary. (Due TOMORROW) ReadWorks Assignment 4 – Fables I have assigned 7 fables for you to complete in ReadWorks. Please work on them over the next two weeks. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Take your time, do your best reading, and enjoy the stories. PLEASE TRY YOUR BEST TO LOG IN AND GIVE AN ANSWER. PLEASE DO NOT WRITE KOREAN OR WRITE ‘I DON’T KNOW’ The next story video is https://www.youtube.com/watch?v=cccG9bMOfiY Please watch the video until you fully understand The spelling words for next week are: preparations magnificent brooded rejoicing satisfied gigantic flood weary darkness politely chest spilled scold sighed sparkling Math Complete Additional Practice 2-3 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Watch the patterns in motion videos https://www.youtube.com/watch?v=1-Y7EfihicM https://www.youtube.com/watch?v=Yg_1ddUnvmw Language Arts Complete pages 21-22 in the vocabulary workshop book.(Due Thurs) We will act out The Hare and the Tortoise on THURSDAY! (September 4th) This will be done without any papers, so please memorize your lines. Get together with your partner to practice, add expression, and make it fun! Social Studies Please play the review game that will help you understand ‘land and water’ https://play.blooket.com/play?hwId=68b636db83493b08325c0494",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-09-02T07:00:14.041Z"
        }
      ]
    }
  ]
}