{
  "generatedAt": "2026-02-05T15:07:51.981Z",
  "day": "2025-09-19",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-09-19",
          "title": "Upcoming Tests! Friday, September 19 - Science Topic 1 test Tuesday, September 23rd - Language Arts - Grammar Worksho…",
          "details": "Upcoming Tests! Friday, September 19 - Science Topic 1 test Tuesday, September 23rd - Language Arts - Grammar Workshop Unit 1 L1-8 Wednesday, September 24th - Math - Topic 3 Monday, September 29th - Social Studies - Topic 1 Reading Complete pages 22-36 in the workbook (you started this in class) The story next week is 'Living in Deserts'. Please watch the video until you understand the story. https://www.youtube.com/watch?v=NxDlziHeNdg The spelling words for next week are from Vocabulary Workshop Units 3 and 4. active bargain gasp loyal resource sensitive struggle value vary wander capture coward exclaim gloomy insist passage restless shallow shatter talent I have assigned a story on What Lives in the Deserts? Please complete BEFORE NEXT FRIDAY! Some students did not submit their answers. Please answer every question and SUBMIT. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math Complete Additional Practice 3-7 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. I will check the Khan Academy activity on MONDAY! Science Great job on completing the science test today! NO SCIENCE HOMEWORK! Korean Page 110-114 Chinese You need to write the words' student/boy/girl' twice before the next class. Language Arts We completed the Grammar Workshop review in class today. Please complete pages 42-43 in the book and review every page before the test on Tuesday. (Pages 8-43) Complete 1 more journal Example Journal This weekend, my family and I spent time together at church and at the park. On Saturday, my kids went to the Catholic church for their class. They met other children and played together after class. Later, we joined the youth service. The singing was loud and joyful, and I could smell the snacks being prepared in the next room. After the service, families stayed to share cookies and juice. The cookies were sweet, and the juice was cold. On Sunday, we went for a walk around the lake near our house. We enjoyed listening to buskers singing and even saw a small concert. The music was cheerful, and the warm sun sparkled on the water. After walking, we bought ice cream. My chocolate ice cream melted quickly, and it tasted creamy and sweet. Later, we ate pasta for lunch together. It was a wonderful weekend. I felt happy and thankful that my family could spend time together and make special memories. Tips for Writing a Good Journal 1) Use the past tense. Example: I played, we walked, she sang. 2) Check spelling in a dictionary. Don’t guess—look it up if you are not sure. 3) Add sensory words, things you can see, hear, smell, taste, or touch. Example: The ice cream was cold and sweet. 4) Keep a clear structure. Beginning: say when and where. Middle: tell what happened. End: share how you felt. 5) Focus on one or two big events. Don’t try to list everything you did. 6) Use interesting words. Instead of always saying good or fun, try words like exciting, tasty, relaxing, cheerful, loud, and peaceful. Social Studies Read and complete pages 40-42 in the social studies book. These are the assessment practice pages, which will help you prepare for the upcoming test. Social Studies Group Project Your groups are: Land and Water - Stella / Jenny / Jiwoo Weather, Climate and Forces of Nature - Siwoo / Ian Choi / Jason Using Earth’s Resources - Jey / Noah / Alex Interacting with the Environment - Woojoo / Yujoo / Ian Sa Each group has three students. You need to read your chapter in the book and summarize the important information. Then you will reteach your lesson to the class. You must do three things. A Google Slides or PowerPoint presentation that is bright and clear. An A3 poster that is colorful and eye-catching. A quiz that is fun and gets the class involved. The quiz could be an X and O quiz, a fill-in-the-gap quiz, or something online. Each person in the group should take one job. One person makes the slides. One person makes the poster. One person makes the quiz. Your goal is to make your classmates learn from you in a fun and creative way. You will present this on Wednesday, September 24th, the lesson before the social studies test. ReadWorks Assignment 5/6 – Tropical Rainforests / Natural Resources (8 stories) I have assigned a story on Rainforest and 8 stories about natural disasters on ReadWorks. Please complete it within the next 2 weeks. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-09-19T04:33:14.811Z"
        }
      ]
    }
  ]
}