{
  "generatedAt": "2026-02-05T15:07:51.988Z",
  "day": "2025-10-23",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-10-23",
          "title": "❄️ Winter Performance Practice Tomorrow! Hi 3-1! Just a reminder that your Winter Performance rehearsal is tomorrow! …",
          "details": "❄️ Winter Performance Practice Tomorrow! Hi 3-1! Just a reminder that your Winter Performance rehearsal is tomorrow! Since you have Music Class tomorrow, please make sure you practice the songs and dance using the attached video before you come to music class. Ms. Hanmi will be giving you more specific directions and final touches during class. Let's make sure we're ready to go! See you tomorrow! 🎶\n\nUpcomingTests Friday, October 24th - Science Topic 2 (TOMORROW) Reading The story this week is 'Why sun & moon live in the sky. It is a Myth. Please watch the video until you understand the story. https://www.youtube.com/watch?v=BSAknmmJv1M The spelling test for next Friday is: broadly foundation sturdy scales massive plenty dimmed invite enormous mud glittering squishy fur silvery spreads Complete all your AR reading quizzes for your library books! 📚 3-1 Bookaween Story Book – Almost Done! Great news, 3-1! Most of your amazing Bookaween pages are completed! I'm so impressed with the colors and creativity you all put into your characters and stories. We have just a couple of pages left to finish assembling the main story. If you are one of the 1 or 2 students who hasn't brought yours in yet, please make sure you bring your completed page to school tomorrow so we can put our book together! A huge thank you to these friends who have taken on extra pages to help us finalize the book: Jiwoo is in charge of the Cover Page (Page 1). Ian Sa will take control of the Opening Page (Page 2). Yujoo will be in charge of the Last Page. Important Dates for Our Bookaween Story We have two very important dates coming up for our storybook: Monday (October 27th): We will hand the complete book over to Ms. Achat! We need it all finished by this date.Next Thursday, October 30th: We will present our Bookaween story on the stage! To make sure our stage presentation is amazing, please start reviewing your part of the story on your page. We need to learn our lines so we can read our pages clearly and with lots of excitement! Let's make this a great performance! Can't wait to see it all come together and shine on stage! 🤩 Extra reading Please go to ReadWorks and complete some of the stories assigned. They will help you with you work in school and also improve your overall reading. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math No Math book tonight! Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Language Arts Complete pages 62-63 in the Grammar workshop book. (TOMORROW) Social Studies Read and complete pages 64-71 (Due Monday) Science The science test is this TOMORROW Read all the pages you circled in class. Please play this game on Blooket to prepare for the test. https://play.blooket.com/play?hwId=68f5b39c217783b1957fb80c Videos to help you prepare for the test. https://www.youtube.com/watch?v=7ciVh78rsjo https://www.youtube.com/watch?v=5TAIUCYMlIQ https://www.youtube.com/watch?v=5hH5radPWHo",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-10-23T07:58:56.134Z"
        }
      ]
    }
  ]
}