{
  "generatedAt": "2026-02-05T15:14:27.893Z",
  "day": "2025-09-04",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-09-04",
          "title": "Reading Complete pages 92 - 93 in the My View book. ReadWorks Assignment 4 – Fables I have assigned 7 fables for you …",
          "details": "Reading Complete pages 92 - 93 in the My View book. ReadWorks Assignment 4 – Fables I have assigned 7 fables for you to complete in ReadWorks. Please work on them over the next two weeks. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Take your time, do your best reading, and enjoy the stories. PLEASE TRY YOUR BEST TO LOG IN AND GIVE AN ANSWER. PLEASE DO NOT WRITE KOREAN OR WRITE ‘I DON’T KNOW’ This week's story video is https://www.youtube.com/watch?v=cccG9bMOfiY Please watch the video until you fully understand The spelling words for next week are: preparations magnificent brooded rejoicing satisfied gigantic flood weary darkness politely chest spilled scold sighed sparkling Math Complete Additional Practice 2-5 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Read and complete 16-21 in the science book - Patterns in Motion. (DUE Friday) If you are not sure what trapeze means, please watch the video. https://www.youtube.com/watch?v=Ae5WN1RYxnM The video will help also! https://www.youtube.com/watch?v=9ePpWrvOXGY Social Studies We need to read and complete pages 14 -17. Read the information and ensure that all questions on each page are completed. (DUE MONDAY) ReadWorks Assignment 5 – Tropical Rainforests I have assigned a story about the rainforests on ReadWorks. Please complete it this week. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Take your time, do your best reading, and enjoy the stories. Spanish Next week there will be a test in Spanish. Please learn the numbers 1-30.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-09-04T07:01:44.534Z"
        }
      ]
    }
  ]
}