{
  "generatedAt": "2026-02-05T15:07:51.980Z",
  "day": "2025-09-12",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-09-12",
          "title": "Upcoming Tests Friday, September 19 - Science Topic 1 test Tuesday, September 23rd - Language Arts - Grammar Workshop…",
          "details": "Upcoming Tests Friday, September 19 - Science Topic 1 test Tuesday, September 23rd - Language Arts - Grammar Workshop Unit 1 L1-8 Monday, September 29th - Social Studies - Topic 1 Reading The next story in the book is Cocoliso https://www.youtube.com/watch?v=aGrbVelGJOI Please watch the video and become familiar with the story. I have assigned a story on American Crocodiles Please complete it within the next 1 week. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it PLEASE TRY YOUR BEST TO LOG IN AND GIVE AN ANSWER. PLEASE DO NOT WRITE KOREAN OR WRITE ‘I DON’T KNOW’ The spelling words for next week are dream amazing bored discovery proud pilot swamp mammals hummingbird shortcut clinic manatee crocodile rare scientist Please revise them before Friday. You borrowed some new books from the library. Please try to have a regular reading pattern and complete the AR quizzes after you read each book. Math Complete Additional Practice 3-2 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Social Studies Read and complete pages 28-31 in the social studies book. ReadWorks Assignment 5/6 – Tropical Rainforests / Natural Resources (8 stories) I have assigned a story on Rainforest and 8 stories about natural disasters on ReadWorks. Please complete it within the next 2 weeks. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Language Arts Please review Unit 2 (please give the link some time to load) https://www.sadlierconnect.com/anonymous/view-resource/vw?limitProgramTocIds=&productId=35&programSeriesId=1&programTocId=3220&resourceId=81974&hash=dW5kZWZpbmVk https://www.sadlierconnect.com/anonymous/view-resource/vw?limitProgramTocIds=&productId=35&programSeriesId=1&programTocId=3220&resourceId=81978&hash=dW5kZWZpbmVk Journal The next chapter in our Vocabulary Workshop book is “Going Green Every Day.” For homework, please read the story and write a journal entry about how you are protecting the environment in your own life. This connects to what we are learning in Social Studies about taking care of the Earth’s resources. Example Journal The Earth is my favorite planet, and I want to help keep it happy and healthy! When I brush my teeth, I turn off the faucet so the water does not run down the drain. I take short showers to save water for the plants, animals, and people who need it. I use my reusable water bottle instead of plastic ones, and I carry it everywhere so I do not make trash. I also help my family put bottles and cans in the recycling bin. It feels like I’m being a recycling superhero! At home, I remember to turn off the lights when I leave a room. I turn off the air conditioner and use a fan instead, which is cool and saves energy. On the weekend, I ride my bike to the park or walk to my friend’s house instead of using a car. It’s fun to move my body, and it helps the Earth too! When we go shopping, my family buys fruits and vegetables that are grown near our house. That way, the food doesn’t travel far in trucks, which saves gas and helps the planet. I like helping the Earth because even small things make a big difference. The Earth is amazing, and we all need to take care of it every day! Science Complete the Science worksheet related to forces and motion for the next science class. Also read and complete pages 24-31 in the textbook (Monday) Chinese Complete the Chinese writing. Chinese test next Tuesday. Korean Activity book - 6-17 Textbook - 64-65",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-09-12T06:00:49.126Z"
        }
      ]
    }
  ]
}