{
  "generatedAt": "2026-02-05T15:14:27.896Z",
  "day": "2025-10-14",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-10-14",
          "title": "Reading The story this week is 'Why sun & moon live in the sky. It is a Myth. Please watch the video until you unders…",
          "details": "Reading The story this week is 'Why sun & moon live in the sky. It is a Myth. Please watch the video until you understand the story. https://www.youtube.com/watch?v=BSAknmmJv1M Complete the definition paper before WEDNESDAY. The spelling test for this FRIDAY is the following words: atmosphere brilliant convince endure glance harsh plunge precious swift unite Let's make our own origin Myth Think of a title for your own myth. You can make your own idea or choose one of the examples below. We will start writing our stories together in class tomorrow. Here are some example titles to give you ideas: Why the Stars Twinkle How the Elephant Got Its Long Trunk Why the Ocean Has Waves Why the Birds Sing in the Morning How the Mountains Were Made Why the Tiger Has Stripes How Fireflies Got Their Light Why the Turtles Move Slowly How the First Rainbow Appeared Why the Sun Smiles Every Morning Why the Cactus Has Thorns How the First Butterfly Came to Be (You can use one of these or make your own) If you choose one of my examples, please comment on this post so no one else does the same one! Example Myth stories How the rainbow was made https://www.youtube.com/watch?v=S2W42HzDo1A Why the Sky is far away https://www.youtube.com/watch?v=mLmBR0s8TY8 Why the sea is salty https://www.youtube.com/watch?v=b7GJIzjXlJ4 Extra reading Please go to ReadWorks and complete some of the stories assigned. They will help you with you work in school and also improve your overall reading. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math Complete Additional Practice 4-4 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Read pages 56-65 and complete the quiz about electric forces (Due Wednesday) On Wednesday, we’ll be trying some fun experiments to learn about positive and negative charges! Please bring these items if you can: 2 balloons Some string Plastic wrap (a small piece is fine) A piece of wool cloth (or something similar, like a wool sock or small scarf) Small pieces of paper A small piece of aluminum foil We’ll have lots of fun seeing how positive and negative charges work in real life! Social Studies Read and complete pages 48-53\n\nReading The story this week is 'Why sun & moon live in the sky. It is an origin Myth. Please watch the video until you understand the story. https://www.youtube.com/watch?v=BSAknmmJv1M Complete the definition paper before TOMORROW. The spelling test for this FRIDAY is the following words: atmosphere brilliant convince endure glance harsh plunge precious swift unite Let's make our own origin Myth You need to PLAN your origin myth now! Think of the story and make some notes! We will talk about your story in class tomorrow. Don't start the poster or comic yet today, just think of some ideas. (Show me a rough plan TOMORROW) Think of a title for your own myth. You can make your own idea or choose one of the examples below. We will start writing our stories together in class tomorrow. Here are some example titles to give you ideas: Why the Stars Twinkle How the Elephant Got Its Long Trunk Why the Ocean Has Waves Why the Birds Sing in the Morning How the Mountains Were Made Why the Tiger Has Stripes How Fireflies Got Their Light Why the Turtles Move Slowly How the First Rainbow Appeared Why the Sun Smiles Every Morning Why the Cactus Has Thorns How the First Butterfly Came to Be (You can use one of these or make your own) If you choose one of my examples, please comment on this post so no one else does the same one! Example Myth stories How the rainbow was made https://www.youtube.com/watch?v=S2W42HzDo1A Why the Sky is far away https://www.youtube.com/watch?v=mLmBR0s8TY8 Why the sea is salty https://www.youtube.com/watch?v=b7GJIzjXlJ4 Extra reading Please go to ReadWorks and complete some of the stories assigned. They will help you with you work in school and also improve your overall reading. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math Complete Additional Practice 4-5 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Read pages 56-65 and complete the quiz about electric forces (Due Wednesday) On Wednesday, we’ll be trying some fun experiments to learn about positive and negative charges! Please bring these items if you can: 2 balloons Some string Plastic wrap (a small piece is fine) A piece of wool cloth (or something similar, like a wool sock or small scarf) Small pieces of paper A small piece of aluminum foil We’ll have lots of fun seeing how positive and negative charges work in real life! Social Studies Watch the videos that explain Natural, Human, and Capital Resources https://www.youtube.com/watch?v=b8uJQPo8yq0 https://www.youtube.com/watch?v=zEcw8rgNrVs Tomorrow we will have an activity to see how much you know about all these resources. Chinese Log in and practice the Chinese language online Language Arts Complete pages 50-53 in the Vocabulary Workshop book. (THURSDAY) Use some online activities to help. https://www.sadlierconnect.com/anonymous/product/vw?productId=35&programId=259&subjectId=1&gradeId=6&programTOCId=3229&programSeriesId=1&hash=dW5kZWZpbmVk",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-10-14T05:50:16.518Z"
        }
      ]
    }
  ]
}