{
  "generatedAt": "2026-02-05T15:34:33.605Z",
  "day": "2025-08-22",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-08-22",
          "title": "Reading\n\nToday, students took their STAR Reading quiz. I will be sending home a letter for parents to review their ch…",
          "details": "Reading\n\nToday, students took their STAR Reading quiz. I will be sending home a letter for parents to review their child’s current level.\n\nPlease encourage your child to read whenever possible, as regular reading helps improve overall ability. Students can take quizzes on books from the school library, public library, or even books they have at home.\nReading regularly will greatly strengthen skills in every subject.\n\nThe next story video is\nhttps://www.youtube.com/watch?v=cccG9bMOfiY\n\nPlease watch the video until you fully understand\n\nMath\n\nComplete Additional Practice 1-4\n\nPlease have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills.\n\nReading / Language Arts\n\nComplete pages 14-15 in the grammar workshop book (due in the next LA class)\n\nWe will act out the Hare and the Tortoise Next week on FRIDAY (29th)  in the Piazza. Please remember your lines and discuss with your partner how you want to act out the role play.\n\n📝 Weekend Personal Narrative Assignment\n\nThis weekend, you will write a personal narrative in your journal notebook. A personal narrative is a story about something that happened to you, or something you are going to do. You will tell it in your own words and include your feelings, thoughts, and experiences. Steps to Complete Your Personal Narrative Plan in your My View book. \n\nThink about what you want to write about and pick one small event from your weekend.\n\nAdd details. Write what you saw, heard, smelled, tasted, and felt.\n\nUse order words like First, Then, Next, After that, Finally to help your story flow.\n\nShow your feelings. Were you happy, nervous, excited, or scared?\n\nWrite your story in your journal notebook. Make sure it has a beginning, middle, and end.\n\n✏️ Example Personal Narrative\n\nMy Weekend Plans\nMy Weekend\n\n This weekend was a little scary and very fun. On Saturday morning, I went to the dentist to get a dental implant. I felt a little nervous because it was my first time having an implant. First, the dentist checked my teeth and prepared my mouth. Then, they carefully put in the implant. It didn’t hurt too much, and I knew it would make my tooth strong and healthy. After it was done, I went home and rested.\n\nOn Sunday, I took my three kids to a kids' café. I was excited because I knew they would have so much fun. First, we ordered drinks and snacks. Then, my kids played in the ball pit, climbed on the slides, and tried the toys. I watched them and helped when they needed it. After that, we ate some cake and ice cream together. Finally, we went home feeling happy and tired from all the fun.\n\nI enjoyed my weekend. Saturday was a little scary, but Sunday was full of laughter and fun with my kids.\n\n✅ Quick Checklist\nMake sure you picked one small event from your weekend.\n Write what happens first, next, and last.\n Include your feelings and thoughts.\n Add details about what you saw, heard, smelled, tasted, or felt.\n Check that your story has a beginning, middle, and end.\n\nSocial Studies\n🌍 Social Studies Project Homework (DUE AUG 27th)\n\nWe have started our first social studies project! 🎉\nEach student will choose one country (not Korea, since we are learning about other countries) and one city in that country. You will create a poster on A3 paper that includes:\n\nPhysical Geography – mountains, rivers, lakes, deserts, forests\n Human Geography – population, celebrations, foods, famous buildings or landmarks\n Other Important Facts – language, currency, country flag, a map of the country and city, and any other interesting facts you would like to share.\n\nYour poster should be bright, colorful, and creative so we can decorate our classroom with them.\n\nEach student will present their poster to the class next week for about 1–2 minutes.\n\nPlease work on your poster over the weekend so you have time to make it detailed and colorful.\n.\nTry to log into readworks and khanacademy when you have time!\n\nHAVE A GREAT WEEKEND!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-08-22T04:46:56.251Z"
        }
      ]
    }
  ]
}