{
  "generatedAt": "2026-02-05T15:07:51.996Z",
  "day": "2025-12-10",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-12-10",
          "title": "Upcoming Tests Math - Topic 7 - December 11th (Check the practice test) Mr Smith’s Classroom Books Students are welco…",
          "details": "Upcoming Tests Math - Topic 7 - December 11th (Check the practice test) Mr Smith’s Classroom Books Students are welcome to take books from Mr Smith’s classroom library and read them over the winter break. These books belong to our classroom, so please make sure to return them when you are finished. I do not keep a checklist, so I trust everyone to bring the books back so all students can continue to enjoy them. If you have any books at home that you are finished with and would like to donate to Mr Smith’s classroom library, please feel free to send them in. We will add them to the library so everyone in 3-1 can read and share them. I am very proud of how active my students are with their reading, so let’s keep promoting a strong reading culture in 3-1! Today is the last day I will post homework in 2025. Over the winter break, there is a Winter Pack for students to use to keep reading and practising. There is also a book chart for students to continue completing AR quizzes. Khan Academy is always available to work on, as well as ReadWorks and Epic, if students need extra things to do. Working on Khan Academy for Grade 3, 4, or even 5 will really help improve MAP score outcomes. Reading books at home will also support every part of your learning—reading truly is the key to everything. The Winter Pack will also help you prepare for some of the topics we will learn next year. Enjoy your winter break and keep learning a little each day! Winter Festival Countdown! The Winter Festival is coming up this Friday—only 2 more sleeps to go! We can’t wait to see everyone shine on stage. It’s time to practice. Please watch the video below and keep practicing your part at home so we are ready for a great performance. Remember, it’s all about having fun! Don’t worry about getting every step perfect—just practice and enjoy it. Please try to wear Christmassy clothes on the day of the festival if you can. Red and green are great choices. Let’s get festival-ready and have an amazing time together. Go team! Reading Get to page 409 in the My View Book The story this week is Nature's patchwork quilt https://www.youtube.com/watch?v=6u5Y_Ln2imI The spelling test is TOMORROW! Please look at the vocabulary every day! interdependence food chain camouflage adaptations quilt patchwork stitched unique niche roots shrimp seashore shallow Arctic ancestors Extra reading ( I have added some new stories) TO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS Please go to ReadWorks and complete some of the stories assigned. They will assist you with your schoolwork and also enhance your overall reading skills. Go to www.readworks.org/student Math The test is TOMORROW. Please read over the red assessment pages we went over. I have added New Khan Academy lessons related to data. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science We have finished the science book for this year, and we will return to it in January. Over the winter break, there is no science homework, but in the Winter Vacation Pack, there is some space to think about ideas for science experiments. You can use that space to plan simple experiments you might want to try when we come back, or to start thinking about a project for the Science Fair in April. When you have time, think of a few small experiment ideas or anything you might like to explore for the Science Fair. I’m excited to see your ideas in the new year! Social Studies Well done on completing the Social Studies test today! We have no more Social Studies from the book for the rest of this year, and we will return to it in January. In the Winter Vacation Study Pack, I have included some vocabulary from the next chapter. These words might be a little tricky, so please take some time to make a small glossary using pictures and simple definitions. When we study this chapter next year, it will be much easier for you. Great job on the test today—I know Social Studies can be tough because there are many details to remember. Keep up the good work! Language Arts Grammar Workshop 98-103 (Thurs) Vocabulary Workshop 86-87 (Thurs) Korean Winter Break Homework Pages 230-246 Pages 251-253",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-12-10T06:58:17.356Z"
        }
      ]
    }
  ]
}