{
  "generatedAt": "2026-02-05T15:14:27.898Z",
  "day": "2025-10-28",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-10-28",
          "title": "Upcoming Tests Social Studies Chapter 2 - Monday, Nov 3rd (Pages 45-82) Math - Topic 5 - Tuesday, Nov 11th Reading Th…",
          "details": "Upcoming Tests Social Studies Chapter 2 - Monday, Nov 3rd (Pages 45-82) Math - Topic 5 - Tuesday, Nov 11th Reading The story this week is 'Patterns in Nature. Please watch the video until you understand the story. https://www.youtube.com/watch?v=Aph1JPFkeXc Complete the definition paper for TOMORROW The spelling test is TOMORROW nature patterns repeat sequence symmetry backyard twig arranged sets series rainbow seasons cocoon snowflakes beautiful Complete all your AR reading quizzes for your library books! Bookaween Homework (TOMORROW) Please review the story attached to this Google Classroom announcement. Please DO NOT try to edit! For Bookaween, we will present our book on stage this Thursday. Please memorize your part and practice reading it with power and expression. We will practice the whole book together during class. Tonight’s homework: memorize your lines and think of small actions you can do on stage to make your part more exciting. Ian Sa and Yujoo have some extra things to remember so they can read some parts. When others are speaking, you can smile and make small movements, but do not make sounds or take attention away from the reader. Please do not read too fast—everyone should be able to follow and enjoy the story. We will have our practice tomorrow, so please be ready. Playground Improvement Project – Homework (THURSDAY) This week’s project is titled Playground Improvement Project – Letter to the Mayor. Go to your local playground and look around. Think about what could be better—is anything unsafe, dirty, or could be more fun? Take notes and some pictures or make drawings of the areas that need improvement. Write a letter to your apartment management or the mayor explaining what should change and why. Use the worksheet to help you. Write your final letter on an A4 page. Place the letter in the middle and add pictures or drawings around it, or put pictures at the top and the letter below. Due Thursday. Keep working even if you can’t visit the playground—imagine ideas if needed. Letters should include drawings or pictures, and we will display them. I will collect all letters on Thursday morning. Math Complete Additional Practice 5-3 (TOMORROW) Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Social Studies Read and complete pages 77-79. (TOMORROW) Science Science Homework – Water Cycle Project (TOMORROW) For our next science lesson, we will make a Water Cycle Project. Please bring the following items on Wednesday: One medium-sized clear ziplock bag (not too big, so it can fit on the window) A name pen (to write your name on the bag) You don’t need to bring food coloring for the water—I already have it. We will make our water cycle bags, tape them to the window, and watch what happens when it gets hotter and colder. Language Arts Please get to Page 63 in the grammar workshop and vocabulary workshop book (This is due NEXT TUESDAY) https://www.sadlierconnect.com/anonymous/view-resource/vw?limitProgramTocIds=&productId=35&programSeriesId=1&programTocId=3230&resourceId=82008&hash=dW5kZWZpbmVk https://www.sadlierconnect.com/anonymous/view-resource/gw?limitProgramTocIds=&productId=494&programSeriesId=3&programTocId=209&resourceId=287892&hash=dW5kZWZpbmVk Korean Page 80-81 and 120-131",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-10-28T06:31:09.403Z"
        }
      ]
    }
  ]
}