{
  "generatedAt": "2026-02-05T15:14:27.891Z",
  "day": "2025-08-19",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-08-19",
          "title": "📢 Dear Parents, Ms. SunLi has prepared a helpful video to show you how to use the eChinese website at home. This wil…",
          "details": "📢 Dear Parents, Ms. SunLi has prepared a helpful video to show you how to use the eChinese website at home. This will give students a great way to review and practice their Chinese learning outside of class. 👉 Please watch the video and try using the website together with your child. If you have any questions about the video or the website, please contact Ms. SunLi directly. Thank you for supporting your child’s language learning! Thanks\n\nReading Complete pages 42-43 in the MY View Reading Book Please watch the video if you need help. https://www.youtube.com/watch?v=hLASwjg7fQo Please complete the definition paper for tomorrow. Use your own words—it's fine to check a dictionary for help, but be sure to explain in your own way. This will be checked tomorrow. Complete the AR quiz for Grandma and the great gourd. You can log in and search the title, and take the quiz. If you are not sure of the story, please read or watch the video again. Readworks Assignment 2 - The Star Maiden: An Ojibway Legend 1. Have students go to www.readworks.org/student 2. Students enter class code YU6GQ2 3. Tell your students that their default password is 1234 The spelling test words for this Friday are fierce baring flexing crouching swipe hut chores skinny sleek fertilizer gourd dizzy paw drolling lentils Please prepare for the test on Friday Math Complete the Multiplication Flower Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Let’s have fun asking questions like a scientist tomorrow. Bring your mystery object and we will try to guess what it is. Language Arts Complete pages 10-11 in the grammar workshop book Complete the game to enhance learning https://www.sadlierconnect.com/anonymous/view-resource/gw?limitProgramTocIds=&productId=494&programSeriesId=3&programTocId=208&resourceId=287881&hash=dW5kZWZpbmVk Today you were given a role play to act out with a partner. You will act out the role play of the Tortoise and the Hare next week.(TUESDAY) Social Studies Complete the continents coloring sheet",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-08-19T05:25:36.452Z"
        }
      ]
    }
  ]
}