{
  "generatedAt": "2026-02-05T15:07:51.986Z",
  "day": "2025-10-15",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-10-15",
          "title": "Reading Complete pages 196-199 in the My View book The story this week is 'Why sun & moon live in the sky. It is a My…",
          "details": "Reading Complete pages 196-199 in the My View book The story this week is 'Why sun & moon live in the sky. It is a Myth. Please watch the video until you understand the story. https://www.youtube.com/watch?v=BSAknmmJv1M Complete the definition paper before WEDNESDAY. The spelling test for this FRIDAY is the following words: atmosphere brilliant convince endure glance harsh plunge precious swift unite Let’s Make Our Own Origin Myth! 🌏✨ Today, we found the title of our origin Myth 1) Jenny - Why did people choose Earth 2) Ian C - Why the elephant has a long trunk 3) Jason - Why are monkeys so smart 4) Jiwoo - Why Orcas are strong and black 5) Jey - How the starts twinkle 6) Noah - Why the Komodo Dragon has strong poison 7) Yujoo - Why - Why are foxes organge 8) Stells - Why do squid have long legs 9) Wj - Why are monkeys swift 10) Siwoo - Why are turtles so slow 11) Ian S - Why does the sun come out in the morning 12) Alex - Why do sea otters wrap seaweed around their bodies Today, everyone chose a great title for their origin myth — well done! For homework, please make a rough draft of your story. You will share it with your friends tomorrow after we read together in class. Your story should explain how or why something began — just like the myths we’ve been reading. Be creative and make sure your story has a beginning, middle, and ending. After we share, you’ll make your final version on a poster to display on our classroom windows! Can’t wait to read your ideas tomorrow, Grade 3 storytellers! 🌟 Example Origin Myths How the Firefly Got Its Light Once, deep in a rainforest dripping with rain and echoing with frogs, there lived a tiny gray beetle who was always ignored. The butterflies showed off their colors, and the bees buzzed proudly about their honey, but the little beetle had nothing special. One night, as he sat sadly by a puddle, a falling star splashed beside him. “You look dim,” said the star kindly. “Would you like a bit of my shine?” The beetle nodded shyly, and the star touched his back. Suddenly, a golden glow burst from the beetle’s tail! He flew into the night, lighting the forest like a tiny lantern. From that night on, he shared his light with others who felt unseen—and that’s how fireflies came to sparkle across the dark forests every summer night. Why Zebras Have Stripes Long ago, zebras were plain white and loved to roll in the mud. One hot day, a zebra found a cool, shiny black rock and lay down on it to rest. When he stood up, black lines covered his back! The other zebras thought he looked amazing and wanted lines too. They rolled and rolled across the rock until their bodies were covered in black stripes. Ever since then, zebras have worn their stripes proudly under the sun. Why the Parrot Has Bright Feathers Long ago, all parrots were gray and dull. They lived quietly in the jungle trees, afraid of being noticed. One day, Rainbow, the sky painter, flew over the forest with buckets of color. She was in such a hurry to finish painting the sunset that she tripped over a tall tree—and Red, yellow, green, and blue paint rained down on the parrots below! The parrots gasped when they saw their shiny new feathers. They squawked and danced and showed off their bright colors to every animal in the jungle. Rainbow laughed and said, “You wear my colors better than the sky!” And ever since that day, parrots have been the most colorful birds in the world. Example Myth stories How the rainbow was made https://www.youtube.com/watch?v=S2W42HzDo1A Why the Sky is far away https://www.youtube.com/watch?v=mLmBR0s8TY8 Why the sea is salty https://www.youtube.com/watch?v=b7GJIzjXlJ4 Extra reading Please go to ReadWorks and complete some of the stories assigned. They will help you with you work in school and also improve your overall reading. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math Complete Additional Practice 4-5 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science We had a fun time today experimenting with balloons and learning about electrical forces! The students did a great job discovering how objects can attract or repel each other. There is no homework today. Enjoy your evening, everyone! Social Studies Read and complete pages 56-61 in the Social Studies test book. Language Arts 50-53 should be finished in the Vocabulary Workshop book.\n\nSome snapshots from today’s science lesson on electric forces! We had a blast experimenting with balloons, exploring how they can attract objects or repel each other depending on the charges. It was so much fun seeing these invisible forces in action!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-10-15T08:01:55.927Z"
        }
      ]
    }
  ]
}