{
  "generatedAt": "2026-02-05T15:34:33.604Z",
  "day": "2025-08-14",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-08-14",
          "title": "Reading\n\nPlease watch the video of the story we will read next week. \n\nhttps://www.youtube.com/watch?v=hLASwjg7fQo\n\nP…",
          "details": "Reading\n\nPlease watch the video of the story we will read next week. \n\nhttps://www.youtube.com/watch?v=hLASwjg7fQo\n\nPlease have the all about me poster ready for MONDAY. We will put them on the window so please decorate well.\n\nReadworks Assignment 1 -  A special Birthday \n1. Have students go to www.readworks.org/student\n2. Students enter class code YU6GQ2\n3. Tell your students that their default password is 1234\nNote: Students can change their passwords when they log in, and you can change student passwords on this page.\n\nMath\n\nToday we started math \n\nPlease complete pages 7-8 in the math textbook. \n\nTo help students improve in math, parents are encouraged to have their child log in to Khan Academy at https://www.khanacademy.org/join/VK6QDS9E and practice as often as possible. Regular practice really helps strengthen skills. Once students finish the easier exercises, they can also try some 4th- or 5th-grade math for an extra challenge.\n\nHere is a fun video related to multiplication\n\nhttps://www.youtube.com/watch?v=6fan6ggvh4U \n\nScience\n\nBring the mystery bag with ONE item for Monday!\n\nLanguage Arts\n\nLanguage Arts – First Journal Assignment\n\nThis week, you will write your first journal entry in your journal notebook. Remember to:\n Have a beginning, middle, and ending.\n\n1) Use the past tense for past events like went, saw, played, or ate.\n2) Add sensory details such as what you saw, heard, smelled, touched, or tasted.\n3) Focus on one main event.\n4) You can include pictures, photos, or tickets if you want.\n\nExample Journal\n This weekend was National Liberation Day, so I had three days off. On Friday, the weather was cloudy and rainy, so I stayed home and played card games with my family. We love playing UNO and Old Maid. I laughed a lot when my kids made silly faces. In the evening, we watched a funny movie and ate warm, buttery popcorn. It felt nice to relax together.\n\nOn Saturday, the weather was sunnier, so I took my kids to the playground. They rode their bikes and splashed in the cool water fountains. The sound of the water made the park feel like summer. On Sunday, we went out for delicious food and then visited the reptile store to get something new for our lizard, Gizmo. I liked seeing all the snakes and turtles. It was a great three-day weekend to rest and have fun with my family.\n\nHave a fantastic long weekend everyone, and well done on the first week of school!@\n\nSee you on MondaY!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-08-14T07:10:19.150Z"
        }
      ]
    }
  ]
}