{
  "generatedAt": "2026-02-05T15:14:27.900Z",
  "day": "2025-11-14",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-11-14",
          "title": "Reading Everyone needs to get to page 79 in the My View practice workbook. (This was completed by most people in clas…",
          "details": "Reading Everyone needs to get to page 79 in the My View practice workbook. (This was completed by most people in class today) The story this week is 'Wolf Island.\" https://www.youtube.com/watch?v=N6LsBdRnboI&t=10s The spelling test next Friday is depended well-being population available balance meadows pups curious sniffed howled mainland scrambled mild gnawed returned Extra reading ( I have added some new stories) TO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS Please go to ReadWorks and complete some of the stories assigned. They will assist you with your schoolwork and also enhance your overall reading skills. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it. Math Complete Additional Practice 6-3 I have added New Khan Academy related to area. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Read Pages 100-109 and complete the lesson quiz (Due MONDAY) Watch the videos about seasonal weather https://www.youtube.com/watch?v=4HeeCYVqf3U https://www.youtube.com/watch?v=H32W-6CKdfk&list=RDH32W-6CKdfk&start_radio=1 Social Studies Complete Pages 88-93 (DUE MONDAY) World Heritage Day – Ireland Project Is Coming Up Very Soon Great job in class today, starting your Ireland booth. Now keep improving your ideas with your group. Your booth should have: A short teaching part (1–2 minutes) A fun activity (3–4 minutes) Green, white, and orange decorations Fair teamwork from everyone World Heritage Day is only 5–6 days away. Over the weekend, think about what you can add. On Monday, I need to see what each person in your group has completed, so please come prepared. Remember: short facts + fun activities = the best booth! Spanish Write the Spanish words of the song Golden https://www.youtube.com/watch?v=DMd18zBUbM0&list=RDDMd18zBUbM0&start_radio=1 Language Arts Complete pages 72-75 Korean (MONDAY) Pages 154-159",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-11-14T01:17:57.154Z"
        }
      ]
    }
  ]
}