{
  "generatedAt": "2026-02-05T15:14:27.891Z",
  "day": "2025-08-14",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-08-14",
          "title": "Reading Please watch the video of the story we will read next week. https://www.youtube.com/watch?v=hLASwjg7fQo Pleas…",
          "details": "Reading Please watch the video of the story we will read next week. https://www.youtube.com/watch?v=hLASwjg7fQo Please have the all about me poster ready for MONDAY. We will put them on the window so please decorate well. Readworks Assignment 1 - A special Birthday 1. Have students go to www.readworks.org/student 2. Students enter class code YU6GQ2 3. Tell your students that their default password is 1234 Note: Students can change their passwords when they log in, and you can change student passwords on this page. Math Today we started math Please complete pages 7-8 in the math textbook. To help students improve in math, parents are encouraged to have their child log in to Khan Academy at https://www.khanacademy.org/join/VK6QDS9E and practice as often as possible. Regular practice really helps strengthen skills. Once students finish the easier exercises, they can also try some 4th- or 5th-grade math for an extra challenge. Here is a fun video related to multiplication https://www.youtube.com/watch?v=6fan6ggvh4U Science Bring the mystery bag with ONE item for Monday! Language Arts Language Arts – First Journal Assignment This week, you will write your first journal entry in your journal notebook. Remember to: Have a beginning, middle, and ending. 1) Use the past tense for past events like went, saw, played, or ate. 2) Add sensory details such as what you saw, heard, smelled, touched, or tasted. 3) Focus on one main event. 4) You can include pictures, photos, or tickets if you want. Example Journal This weekend was National Liberation Day, so I had three days off. On Friday, the weather was cloudy and rainy, so I stayed home and played card games with my family. We love playing UNO and Old Maid. I laughed a lot when my kids made silly faces. In the evening, we watched a funny movie and ate warm, buttery popcorn. It felt nice to relax together. On Saturday, the weather was sunnier, so I took my kids to the playground. They rode their bikes and splashed in the cool water fountains. The sound of the water made the park feel like summer. On Sunday, we went out for delicious food and then visited the reptile store to get something new for our lizard, Gizmo. I liked seeing all the snakes and turtles. It was a great three-day weekend to rest and have fun with my family. Have a fantastic long weekend everyone, and well done on the first week of school!@ See you on MondaY!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-08-14T07:10:19.150Z"
        }
      ]
    }
  ]
}