{
  "generatedAt": "2026-02-05T15:07:51.992Z",
  "day": "2025-11-13",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-11-13",
          "title": "Reading Everyone needs to get to page 305 in the My View Book. (This was completed by most people in class today) Bri…",
          "details": "Reading Everyone needs to get to page 305 in the My View Book. (This was completed by most people in class today) Bring your My View workbook to school tomorrow. The story this week is 'Weird Friends.\" Please watch the video until you understand the story. https://www.youtube.com/watch?v=ZdYQdzhaurc The spelling test is on TOMORROW! predators protection immune species emerges cluster sea anemone tentacles rhino egret blind antennae detect flee pod Here are some videos for the weirdest friends. https://www.youtube.com/watch?v=vNhORnwcQcU&t=11s https://www.youtube.com/watch?v=9ONsv_ivZjM https://www.youtube.com/watch?v=GdC0Akpa2ts https://www.youtube.com/watch?v=yKaVUKQj9WQ https://www.youtube.com/watch?v=h-JGazEs7jY https://www.youtube.com/watch?v=BM8TczDI0g0 https://www.youtube.com/watch?v=dYFALyP2e7U https://www.youtube.com/watch?v=ZtCvZElAroI https://www.youtube.com/watch?v=aIovmgzyuL0 https://www.youtube.com/watch?v=-m6fyMTg2vo https://www.youtube.com/watch?v=jSMSRdI5WR4 https://www.youtube.com/watch?v=44JUXPzEI2U https://www.youtube.com/watch?v=TFAOnPvNyQI Extra reading ( I have added some new stories) TO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS Please go to ReadWorks and complete some of the stories assigned. They will help you with your work in school and also improve your overall reading. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it. Math Complete Additional Practice 6-2 I have added New Khan Academy related to area. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Please Learn about weather instruments before Friday https://www.youtube.com/watch?v=VkyfKtpPZG8 https://www.youtube.com/watch?v=BxGmVlH3DJ4 Language Arts Well done on completing your grammar test today! No extra homework. Music The Winter Festival is coming soon! Please practice your dance at home three times tonight so you will be ready for music class tomorrow. Let’s make sure we all know the moves and have fun together! Social Studies Complete Pages 88-93 (DUE MONDAY) Keep working on your World Heritage Day project. World Heritage Day – Ireland Project Reminder Please make sure you are working on your World Heritage Day – Ireland project. Discuss with your group and start generating fun and exciting ideas for your booth. You have 1 class tomorrow, first period, to work on this, so be ready, as the teacher will be assessing your effort and making sure everyone has put effort into their group. Your booth should have: Something to teach (1–2 minutes) An activity visitors can try (3–4 minutes) Pictures and decorations – write, draw, or color, using green, white, and orange Team balance – make sure everyone in your group contributes fairly. Some students are going home and spending hours preparing, while others need to try harder. Think about how you can add value, make your group better, and make it more fun for everyone. Individual and group grades – the work you do for the board and activity will be graded individually, and how you interact with other students during World Heritage Day will also be part of your grade. Think carefully about your ideas and come to class ready to share them. Be creative and make your booth fun and engaging for everyone who visits the Ireland showroom.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-11-13T05:47:03.527Z"
        }
      ]
    }
  ]
}