{
  "generatedAt": "2026-02-05T15:34:33.623Z",
  "day": "2025-10-23",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-10-23",
          "title": "❄️ Winter Performance Practice Tomorrow!\n\nHi 3-1!\n\nJust a reminder that your Winter Performance rehearsal is tomorrow…",
          "details": "❄️ Winter Performance Practice Tomorrow!\n\nHi 3-1!\n\nJust a reminder that your Winter Performance rehearsal is tomorrow!\n\nSince you have Music Class tomorrow, please make sure you practice the songs and dance using the attached video before you come to music class.\n\nMs. Hanmi will be giving you more specific directions and final touches during class. Let's make sure we're ready to go!\n\nSee you tomorrow! 🎶\n\nUpcomingTests\nFriday, October 24th - Science Topic 2 (TOMORROW)\n\nReading\n\nThe story this week is 'Why sun & moon live in the sky. It is a Myth. \n\nPlease watch the video until you understand the story.\n\nhttps://www.youtube.com/watch?v=BSAknmmJv1M \n\nThe spelling test for next Friday is:\n\nbroadly \nfoundation\nsturdy\nscales\nmassive\nplenty\ndimmed\ninvite\nenormous\nmud\nglittering \nsquishy\nfur\nsilvery\nspreads\n\nComplete all your AR reading quizzes for your library books!\n\n📚 3-1 Bookaween Story Book – Almost Done!\n\nGreat news, 3-1! Most of your amazing Bookaween pages are completed! I'm so impressed with the colors and creativity you all put into your characters and stories. \n\nWe have just a couple of pages left to finish assembling the main story. If you are one of the 1 or 2 students who hasn't brought yours in yet, please make sure you bring your completed page to school tomorrow so we can put our book together!\n\nA huge thank you to these friends who have taken on extra pages to help us finalize the book:\nJiwoo is in charge of the Cover Page (Page 1).\nIan Sa will take control of the Opening Page (Page 2).\nYujoo will be in charge of the Last Page.\nImportant Dates for Our Bookaween Story\n\nWe have two very important dates coming up for our storybook:\nMonday (October 27th): We will hand the complete book over to Ms. Achat! We need it all finished by this date.Next Thursday, October 30th: We will present our Bookaween story on the stage!\n\nTo make sure our stage presentation is amazing, please start reviewing your part of the story on your page. We need to learn our lines so we can read our pages clearly and with lots of excitement! Let's make this a great performance!\nCan't wait to see it all come together and shine on stage! 🤩\n\nExtra reading\n\nPlease go to ReadWorks and complete some of the stories assigned. They will help you with you work in school and also improve your overall reading.\n\nGo to www.readworks.org/student \n\nEnter our class code YU6GQ2\nYour password is 1234 unless you already changed it\nMath\nNo Math book tonight!\n\nPlease have your child practice a little Khan Academy math each night\n at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills.\n\nLanguage Arts\n\nComplete pages 62-63  in the Grammar workshop book. (TOMORROW)\n\nSocial Studies\n\nRead and complete pages 64-71 (Due Monday)\n\nScience\n\nThe science test is this TOMORROW \n\nRead all the pages you circled in class.\n\nPlease play this game on Blooket to prepare for the test.\n\nhttps://play.blooket.com/play?hwId=68f5b39c217783b1957fb80c\n\nVideos to help you prepare for the test.\n\nhttps://www.youtube.com/watch?v=7ciVh78rsjo\nhttps://www.youtube.com/watch?v=5TAIUCYMlIQ \nhttps://www.youtube.com/watch?v=5hH5radPWHo",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-10-23T07:58:56.134Z"
        }
      ]
    }
  ]
}