{
  "generatedAt": "2026-02-05T15:14:27.896Z",
  "day": "2025-09-26",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-09-26",
          "title": "MAP Tests Completed! Great job, everyone! You have finished all of your MAP tests, and I am very proud of your hard w…",
          "details": "MAP Tests Completed! Great job, everyone! You have finished all of your MAP tests, and I am very proud of your hard work and progress. I could see how much effort you put in, and I am excited about the growth you are showing. Well done! 🎉 Upcoming Class Tests! Monday, September 29th - Social Studies - Topic 1 Reading Complete Page up to page 167 in the My View Book The story this week is 'Living in Deserts'. Please watch the video until you understand the story. https://www.youtube.com/watch?v=NxDlziHeNdg The spelling words for Next Thursday are: shield lack exposure nomadic landscape extreme drowned heatstroke protect conditions traditional climate oasis barren pollution I have assigned a story on What Lives in the Deserts? (DUE FRIDAY) Please complete BEFORE TOMORROW! Please answer every question and SUBMIT. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math We took a break from math today! We will start topic 4 on Monday! Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Language Arts Complete pages 46-47 in the Grammar Workshop book Journal Writing – Chuseok Plans This weekend, I would like you to write a journal about what you are going to do during Chuseok, the Korean Thanksgiving. Please remember: Use the future tense with “going to / will\" Organize your writing with an introduction, body, and conclusion Use sequence words (First, Next, After that, Finally) Write in full sentences Here is my example journal: This Chuseok, I will spend time with my family and enjoy the long holiday. It is going to be a very special time. First, I am going to hang out with my kids at the Han River. We are going to ride bikes, play games, and enjoy the fresh air together. After that, we are going to visit my parents-in-law. We are going to eat a delicious family dinner, and it is going to be a good way to show respect to my family. Since it is a long vacation, I am also going to take my kids to the Palaces in Seoul because they are free during Chuseok. We are going to walk around, take pictures, and learn more about Korean history. At home, we are going to rest, watch movies, and enjoy some relaxing family time. I am sure this Chuseok is going to be wonderful. I am going to make many happy memories with my family. Korean Pages 115-119 and 20-33 in the Korean textbook and activity book. Chinese You need to write the words' student/boy/girl' twice before the next class. Social Studies The Social Studies test is on MONDAY! Please read pages 1-42 in the Social Studies book. Science Complete pages 56-61 in the science book.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-09-26T06:46:15.412Z"
        }
      ]
    }
  ]
}