{
  "generatedAt": "2026-02-05T15:14:27.902Z",
  "day": "2025-12-08",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-12-08",
          "title": "Upcoming Tests Social Studies - Chapter 3 December 10th (pages 84-136) Math - Topic 7 - December 11th Winter Festival…",
          "details": "Upcoming Tests Social Studies - Chapter 3 December 10th (pages 84-136) Math - Topic 7 - December 11th Winter Festival Countdown! The Winter Festival is coming up this Friday, and we can’t wait to see everyone shine on stage. It’s time to practice. Please watch the video below and keep practicing your part at home so we are ready for a great performance. Please try to wear Christmassy clothes on the day of the festival if you can. Red and green are great choices. Let’s get festival-ready and have an amazing time together. Go team! Reading Complete the definition paper by WEDNESDAY The story this week is Nature's patchwork quilt https://www.youtube.com/watch?v=6u5Y_Ln2imI The spelling test is next Thursday! Please look at the vocabulary every day! interdependence food chain camouflage adaptations quilt patchwork stitched unique niche roots shrimp seashore shallow Arctic ancestors Extra reading ( I have added some new stories) TO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS Please go to ReadWorks and complete some of the stories assigned. They will assist you with your schoolwork and also enhance your overall reading skills. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it. Math Complete the red assessment pages (By TOMORROW) I have added New Khan Academy lessons related to data. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Complete pages 140-141 in the science textbook (By Wednesday) Chinese Memorise the worksheet given in class by Tomorrow. Social Studies Complete pages 133-136 in the social studies book (Due TOMORROW) Language Arts Grammar Workshop 94-95 (Tuesday) Vocabulary Workshop 82-83(Tuesday) Korean Winter Break Homework Pages 230-246 Pages 251-253",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-12-08T01:18:34.793Z"
        }
      ]
    }
  ]
}