{
  "generatedAt": "2026-02-05T15:07:51.988Z",
  "day": "2025-10-21",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-10-21",
          "title": "UpcomingTests Thursday, October 23rd -Math Topic 4 Friday, October 24th - Science Topic 2 Reading Complete this week'…",
          "details": "UpcomingTests Thursday, October 23rd -Math Topic 4 Friday, October 24th - Science Topic 2 Reading Complete this week's definition paper (Due Tomorrow) The story this week is 'Why sun & moon live in the sky. It is a Myth. Please watch the video until you understand the story. https://www.youtube.com/watch?v=BSAknmmJv1M The spelling test for next Friday is: broadly foundation sturdy scales massive plenty dimmed invite enormous mud glittering squishy fur silvery spreads Complete all your AR reading quizzes for your library books! 🎃 3-1 Bookaween Story Book – Time to Make Your Page! Hi 3-1! It is time to start making your page for our Bookaween storybook for Halloween. Use the guide we went over today to help you. Here is what to do: Make your own page for your character. Think about the other characters too so your page matches the story. Write your part of the story clearly on your page so everyone can read it. Use lots of color to make your page fun and Halloween-y! I have attached the story to this announcement. Please feel free to change things and add your own touches. I want you to make it your own, but keep the story similar so the whole story makes sense. We will have 12 pages completed by Thursday. After that, we can make the cover (page 1) and the back page together. Can’t wait to see your amazing pages! 🖍️✨ Extra reading Please go to ReadWorks and complete some of the stories assigned. They will help you with you work in school and also improve your overall reading. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Language Arts Complete pages 58-59 in the Grammar workshop book. https://www.sadlierconnect.com/anonymous/view-resource/gw?limitProgramTocIds=&productId=494&programSeriesId=3&programTocId=209&resourceId=287892&hash=dW5kZWZpbmVk Math The math test is on Thursday! The assessment pages in the book are very similar to what will be on the test. Tonight, we will work on the assessment pages in class. Tomorrow, we will practice by answering some questions on the board and explaining our answers to everyone. This will help make sure we are ready for the test. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Complete the Assessment pages from the book. Pages 78-81 (Due Wednesday) Complete the Lesson Quiz on Magnetism (Due Wednesday) The science test is this Friday! Please play this game on Blooket to prepare for the test. https://play.blooket.com/play?hwId=68f5b39c217783b1957fb80c Happy Birthday, Stella! Here is the Stella Quiz! https://play.blooket.com/play?hwId=68f71762b0d1c8c610e72613 Have a great evening!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-10-21T06:35:21.155Z"
        }
      ]
    }
  ]
}