{
  "generatedAt": "2026-02-05T15:07:51.990Z",
  "day": "2025-11-04",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-11-04",
          "title": "Upcoming Tests Social Studies Chapter 2 - Wednesday, Nov 5th (Pages 45-82) Math - Topic 5 - Tuesday, Nov 11th Grammar…",
          "details": "Upcoming Tests Social Studies Chapter 2 - Wednesday, Nov 5th (Pages 45-82) Math - Topic 5 - Tuesday, Nov 11th Grammar Workshop - Unit 2 - NOUNS (L9-14) - Thursday, Nov 13th Social Studies The social Studies test is TOMORROW! I created a Blooket that is very similar to the test! https://play.blooket.com/play?hwId=690a05724e73cc8dc26d3c6e Please try to play until you get the questions correct. Also, please remember the skills people need for jobs and your future job. World Heritage Day – Ireland Project Update Today in class you worked in your groups to plan your World Heritage Day project about Ireland. Great start, everyone! For homework, please research your topic further and start thinking of fun, interactive ways to make your group’s activity exciting for visitors. Remember—each group should have: Something to teach (1–2 minutes on your topic) An activity (3–4 minutes) that visitors can try Some students mentioned they have a foam board at home—if you do, you can bring it to school to help make your display. Posters, photos, and decorations will make your booth stand out. This project is very important and will count as a big part of your Social Studies grade for Quarter 2. World Heritage Day is on November 20th, so we do not have much time left. Please make sure you are preparing and coming to class ready with new ideas to share. Let’s make Ireland proud! 🇮🇪 Irish Language & Culture Team – Ian C, Alex, Noah: Teach simple Irish words and counting with a short speaking activity. https://www.youtube.com/watch?v=qpYIa4iReRc Irish Symbols & Landmarks Team – Woojoo, Jason, Siwoo: Explain Irish symbols and landmarks and lead an origami or matching activity. https://www.youtube.com/watch?v=fZuF5ettV_U Irish Dance & Music Team – Stella, Jiwoo, Yujoo: Show Irish dance and music and run a fun dance or rhythm activity. https://youtube.com/shorts/Q238t7hYWtg?si=Hwg3ZZEgYFP0GQCS Irish Myths, Animals & Legends Team – Jenny, Jey, Ian Sa: Share Irish myths with animals and guide a creative storytelling or puppet activity. https://www.youtube.com/watch?v=2AJGDUHFmhk https://www.youtube.com/watch?v=EbxiUJ3rpFA https://www.youtube.com/watch?v=slIHgO5eUD4 Reading Complete 254-255 in the reading textbook The story this week is 'Patterns in Nature. Please watch the video until you understand the story. https://www.youtube.com/watch?v=Aph1JPFkeXc Definitions Paper is due on WEDNESDAY. The spelling test is on THURSDAY this week! border certain clasp depart fierce journey observe superb treasure wisdom Extra reading Please go to ReadWorks and complete some of the stories assigned. They will help you with your work in school and also improve your overall reading. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math Complete Additional Practice 5-6 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Complete the Lesson Quiz about weather and water. (WEDNESDAY) Read and complete pages 90-96 in the science book Language Arts Grammar Workshop Pages 66-67 https://www.sadlierconnect.com/anonymous/view-resource/gw?limitProgramTocIds=&productId=494&programSeriesId=3&programTocId=209&resourceId=287894&hash=dW5kZWZpbmVk Korean (MONDAY) Pages 103-105 and 137-139 Also finish to page 45",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-11-04T13:54:53.929Z"
        }
      ]
    }
  ]
}