{
  "generatedAt": "2026-02-05T15:34:33.623Z",
  "day": "2025-10-28",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-10-28",
          "title": "Upcoming Tests\n\nSocial Studies Chapter 2 - Monday, Nov 3rd  (Pages 45-82)\n\nMath - Topic 5 - Tuesday, Nov 11th\n\nReadin…",
          "details": "Upcoming Tests\n\nSocial Studies Chapter 2 - Monday, Nov 3rd  (Pages 45-82)\n\nMath - Topic 5 - Tuesday, Nov 11th\n\nReading\n\nThe story this week is 'Patterns in Nature. \n\nPlease watch the video until you understand the story.\n\nhttps://www.youtube.com/watch?v=Aph1JPFkeXc\n\nComplete the definition paper for TOMORROW\n\nThe spelling test is TOMORROW\n\nnature\npatterns\nrepeat\nsequence\nsymmetry\nbackyard\ntwig\narranged\nsets\nseries\nrainbow\nseasons\ncocoon \nsnowflakes\nbeautiful\nComplete all your AR reading quizzes for your library books!\n\nBookaween Homework (TOMORROW)\n\nPlease review the story attached to this Google Classroom announcement. Please DO NOT try to edit!\nFor Bookaween, we will present our book on stage this Thursday.\n\nPlease memorize your part and practice reading it with power and expression. We will practice the whole book together during class.\n\nTonight’s homework: memorize your lines and think of small actions you can do on stage to make your part more exciting. Ian Sa and Yujoo have some extra things to remember so they can read some parts.\n\nWhen others are speaking, you can smile and make small movements, but do not make sounds or take attention away from the reader.\n\nPlease do not read too fast—everyone should be able to follow and enjoy the story.\n\nWe will have our practice tomorrow, so please be ready.\n\nPlayground Improvement Project – Homework (THURSDAY)\nThis week’s project is titled Playground Improvement Project – Letter to the Mayor.\nGo to your local playground and look around. Think about what could be better—is anything unsafe, dirty, or could be more fun? Take notes and some pictures or make drawings of the areas that need improvement.\nWrite a letter to your apartment management or the mayor explaining what should change and why. Use the worksheet to help you.\nWrite your final letter on an A4 page. Place the letter in the middle and add pictures or drawings around it, or put pictures at the top and the letter below.\n\nDue Thursday. Keep working even if you can’t visit the playground—imagine ideas if needed. Letters should include drawings or pictures, and we will display them. I will collect all letters on Thursday morning.\n\nMath\n\nComplete Additional Practice 5-3 (TOMORROW)\n\nPlease have your child practice a little Khan Academy math each night\n at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills.\n\nSocial Studies\n\nRead and complete pages 77-79. (TOMORROW)\n\nScience \n\nScience Homework – Water Cycle Project (TOMORROW)\nFor our next science lesson, we will make a Water Cycle Project.\n\nPlease bring the following items on Wednesday:\nOne medium-sized clear ziplock bag (not too big, so it can fit on the window)\nA name pen (to write your name on the bag)\nYou don’t need to bring food coloring for the water—I already have it.\n\nWe will make our water cycle bags, tape them to the window, and watch what happens when it gets hotter and colder.\n\nLanguage Arts\n\nPlease get to Page 63 in the grammar workshop and vocabulary workshop book (This is due NEXT TUESDAY)\n\nhttps://www.sadlierconnect.com/anonymous/view-resource/vw?limitProgramTocIds=&productId=35&programSeriesId=1&programTocId=3230&resourceId=82008&hash=dW5kZWZpbmVk \n\nhttps://www.sadlierconnect.com/anonymous/view-resource/gw?limitProgramTocIds=&productId=494&programSeriesId=3&programTocId=209&resourceId=287892&hash=dW5kZWZpbmVk\n\nKorean\nPage 80-81 and 120-131",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-10-28T06:31:09.403Z"
        }
      ]
    }
  ]
}