{
  "generatedAt": "2026-02-05T15:34:33.623Z",
  "day": "2025-10-27",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-10-27",
          "title": "Reading\n\nThe story this week is 'Patterns in Nature. \n\nPlease watch the video until you understand the story.\n\nhttps:…",
          "details": "Reading\n\nThe story this week is 'Patterns in Nature. \n\nPlease watch the video until you understand the story.\n\nhttps://www.youtube.com/watch?v=Aph1JPFkeXc\n\nThe spelling test is on Wednesday!\n\nnature\npatterns\nrepeat\nsequence\nsymmetry\nbackyard\ntwig\narranged\nsets\nseries\nrainbow\nseasons\ncocoon \nsnowflakes\nbeautiful\nComplete all your AR reading quizzes for your library books!\n\nBookaween Homework\nFor Bookaween, we will present our book on stage next Thursday.\n\nPlease ensure you memorize your part and practice reading it with power and expression. We will practice the whole book together during class.\n\nThe cover and first page are finished—great work, everyone!\n\nOnly two students still need to give me their two pages of the book. Please bring them tomorrow.\n\nToday’s homework:\n\nRemember and act out your part of the story.\nPractice your voice, facial expressions, and gestures to entertain the crowd.\nLet’s make our Bookaween performance fantastic!\n\nPlayground Improvement Project – Homework\n\nThis week’s project is titled 'Playground Improvement Project – Letter to the Mayor.'\n\nGo to your local playground and take a good look around.\n\nThink about what could be better—is there anything that should be safer, cleaner, or more fun?\n\nTake notes and take a few pictures or make drawings of the areas that need improvement.\n\nThen, write a letter to your apartment management or the mayor explaining what you think should change and why.\n\nYou can use the sample letter on the worksheet to help you.\n\nWhat to do:\n\nVisit your playground and write down what you like and what could be improved.\nTake photos or draw the parts that need fixing or cleaning.\nWrite your ideas in the worksheet (sections 1–3).\nType or neatly write your final letter on a separate A4 page and attach your pictures or drawings.\nDue Date: Thursday\n\nExtra reading\n\nPlease go to ReadWorks and complete some of the stories assigned. They will help you with you work in school and also improve your overall reading.\n\nGo to www.readworks.org/student \n\nEnter our class code YU6GQ2\nYour password is 1234 unless you already changed it\n\nMath\n\nComplete Additional Practice 5-2\n\nPlease have your child practice a little Khan Academy math each night\n at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills.\n\nLanguage Arts\n\nComplete pages 62-63 in the Vocabulary workshop book.\n\nSocial Studies\nRead pages 72-75\n\nScience Homework – Water Cycle Project\nFor our next science lesson, we will make a Water Cycle Project.\n\nPlease bring the following items on Wednesday:\n\nOne medium-sized clear ziplock bag (not too big, so it can fit on the window)\nA name pen (to write your name on the bag)\nYou don’t need to bring coloring materials—I already have them.\n\nWe will make our water cycle bags, tape them to the window, and watch what happens when it gets hotter and colder.\n\nKorean\nPage 80-81 and 120-131\n\nA practice Microphone!\n\nDoes anyone have a toy microphone we can use this week to practice for the Bookaween presentation? I am not sure where mine is! Thanks!\n\nAlso don't forget your library books and quizzes by tomorrow!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-10-27T11:35:27.764Z"
        }
      ]
    }
  ]
}