{
  "generatedAt": "2026-02-05T15:07:51.974Z",
  "day": "2025-08-25",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-08-25",
          "title": "Reading 📚 Reading Project – Our Story Books! 🎨 This week, our class will be making small storybooks to help us full…",
          "details": "Reading 📚 Reading Project – Our Story Books! 🎨 This week, our class will be making small storybooks to help us fully understand folktales, fables, fairy tales, legends, and myths. By Friday, students will have created their own wonderful, colorful, and fun storybooks that we can read and share in class. Homework for tonight: Students need to plan their storybook using the worksheet I sent home. This will help them think about their characters, setting, and the beginning, middle, and end of their story. Tomorrow in reading class, we will begin turning these plans into our own little books. This is our first reading project, so I encourage students to take some time to design and prepare carefully. I will also provide time in class to work on them. Thank you for your support at home! Complete the definition paper (due Wednesday) These are the spelling words for this Friday allow faint goal trace bitter firm patient common force prefer Math Complete Additional Practice 1-6 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Watch the video about motion and force. https://www.youtube.com/watch?v=1R6MxJpEjfs https://www.youtube.com/watch?v=xUCYFof8QyA Language Arts ReadWorks Assignment 4 – Fables I have assigned 7 fables for you to complete in ReadWorks. Please work on them over the next two weeks. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Take your time, do your best reading, and enjoy the stories. Social Studies 🌍 Social Studies Project Homework (DUE AUG 27th) We have started our first social studies project! 🎉 Each student will choose one country (not Korea, since we are learning about other countries) and one city in that country. You will create a poster on A3 paper that includes: Physical Geography – mountains, rivers, lakes, deserts, forests Human Geography – population, celebrations, foods, famous buildings or landmarks Other Important Facts – language, currency, country flag, a map of the country and city, and any other interesting facts you would like to share Your poster should be bright, colorful, and creative so we can decorate our classroom with them. Each student will present their poster to the class on Wednesday for about 1–2 minutes. Please work on your poster so you have time to make it detailed and colorful. Please don’t read from notes just stand up and explain the details on your poster. Reflection Today in club time, instead of the fun activity I had planned, we wrote short stories about why it is important to follow school rules. It was a chance to remind everyone that when we line up, listen carefully, and respect each other’s personal space, it makes it possible to enjoy all the fun activities together. The students did a nice job reflecting, and I think they understood that to enjoy special times, we also need to give back by following the rules. I am excited for the next club time and all the fun things ahead once we keep practicing these important habits. Please also remember to place your homework file and math homework book under your desk each morning. This helps us save time and keeps everyone from going back and forth to lockers. Another important reminder is to change into indoor shoes as soon as you arrive so we can start the day smoothly.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-08-25T07:15:44.912Z"
        }
      ]
    }
  ]
}