{
  "generatedAt": "2026-02-05T15:07:51.979Z",
  "day": "2025-09-11",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-09-11",
          "title": "Upcoming Tests Friday, September 19 - Science Topic 1 test Tuesday, September 23rd - Language Arts - Grammar Workshop…",
          "details": "Upcoming Tests Friday, September 19 - Science Topic 1 test Tuesday, September 23rd - Language Arts - Grammar Workshop Unit 1 L1-8 Monday, September 29th - Social Studies - Topic 1 Reading. I have assigned a story on American Crocodiles Please complete it within the next 1 week. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it PLEASE TRY YOUR BEST TO LOG IN AND GIVE AN ANSWER. PLEASE DO NOT WRITE KOREAN OR WRITE ‘I DON’T KNOW’ The next story in the book is Cocoliso https://www.youtube.com/watch?v=aGrbVelGJOI Please watch the video and become familiar with the story. The spelling words for next week are aim aware defeat drift mild pause refuse route ruin solid Please revise them before Friday. You borrowed some new books from the library. Please try to have a regular reading pattern and complete the AR quizzes after you read each book. Math Complete Additional Practice 3-1 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Social Studies Read and complete pages 28-31 in the social studies book. ReadWorks Assignment 5/6 – Tropical Rainforests / Natural Resources (8 stories) I have assigned a story on Rainforest and 8 stories about natural disasters on ReadWorks. Please complete it within the next 2 weeks. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Chinese Complete the Chinese writing. Chinese test next Tuesday. Korean Activity book - 6-17 Textbook - 64-65 Language Arts Read and complete pages 34-35 in the grammar workshop book. https://www.sadlierconnect.com/anonymous/view-resource/gw?limitProgramTocIds=&productId=494&programSeriesId=3&programTocId=208&resourceId=287886&hash=dW5kZWZpbmVk\n\nReminder: Basic School Supplies Some students have been coming to school without basic supplies such as pencils. My extra pencils are almost gone, so please make sure your child has a supply of basic stationery each day (pencils, erasers, etc.). This will help them be prepared and ready for class. Thank you for your support!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-09-11T07:13:11.092Z"
        }
      ]
    }
  ]
}