{
  "generatedAt": "2026-02-05T15:14:27.898Z",
  "day": "2025-11-07",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-11-07",
          "title": "Great job today, everyone! You all did an amazing job on Sports Day — it looked like you had so much fun! Remember, i…",
          "details": "Great job today, everyone! You all did an amazing job on Sports Day — it looked like you had so much fun! Remember, it’s not about winning, it’s about taking part and doing your best. Next week, we have two tests: Math on Tuesday Grammar on Thursday Please review all your previous homework and make sure your Math “Red” pages are finished. For your journal, you have two choices: Bookaween Sports Day You can choose one topic or write about both — it’s up to you1 Reading The story this week is 'Weird Friends\" Please watch the video until you understand the story. https://www.youtube.com/watch?v=ZdYQdzhaurc The spelling test is next Friday! predators protection immune species emerges cluster sea anemone tentacles rhino egret blind antennae detect flee pod Extra reading ( I have added some new stories) TO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS Please go to ReadWorks and complete some of the stories assigned. They will help you with your work in school and also improve your overall reading. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Korean (MONDAY) Pages 103-105 and 137-139 Also finish to page 45 Social Studies We need to make good progress on our World Heritage Day project this weekend. Ideas should start taking shape — make sure you have your photos printed and your games organized. There isn’t much time left, so please take some time to prepare something fun and interesting with your group. There isn’t much other homework, so please make sure to focus on your World Heritage project. HAVE A GREAT WEEKEND!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-11-07T10:02:31.410Z"
        }
      ]
    }
  ]
}