{
  "generatedAt": "2026-02-05T15:14:27.893Z",
  "day": "2025-09-09",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-09-09",
          "title": "Reading Complete this week's definition paper. (Due TOMORROW). Please choose 3 of the words and make a complete sente…",
          "details": "Reading Complete this week's definition paper. (Due TOMORROW). Please choose 3 of the words and make a complete sentence. The next story in the book is Cocoliso https://www.youtube.com/watch?v=aGrbVelGJOI Please watch the video and become familiar with the story. The spelling words for next week are aim aware defeat drift mild pause refuse route ruin solid Please revise them before next Friday. I have assigned 7 fables for you to complete in ReadWorks. Please work on them over the next two weeks. They should all be complete this week. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Take your time, do your best reading, and enjoy the stories. PLEASE TRY YOUR BEST TO LOG IN AND GIVE AN ANSWER. PLEASE DO NOT WRITE KOREAN OR WRITE ‘I DON’T KNOW’ Today you borrowed some new books from the library. Please try to have a regular reading pattern and complete the AR quizzes after you read each book. Math TOMORROW IS THE TOPIC 2 MATH ASSESSMENT Look over the red assessment pages we completed today, as they are similar to the test you will take tomorrow. Please practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. You can also try Khan Academy for grades 4 and 5 if you want more challenges. Please do this after completing grade 3 work. Social Studies ReadWorks Assignment 5/6 – Tropical Rainforests / Natural Resources (8 stories) I have assigned a story on Rainforest and 8 stories about natural disasters on ReadWorks. Please complete within the next 2 weeks. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it What Are Natural Resources? | Types Of Natural Resources https://www.youtube.com/watch?v=ajk-pvm5vfQ Chinese Complete the Chinese writing. Chinese test next Tuesday. Language Arts Complete pages 30-31 in the Grammar workshop book This game might help you. https://www.sadlierconnect.com/anonymous/view-resource/gw?limitProgramTocIds=&productId=494&programSeriesId=3&programTocId=208&resourceId=287886&hash=dW5kZWZpbmVk Science To complete page 25 in the book, we need: a steel ball / some magnets / a straw If you have any of these items, please bring them Tomorrow, and we can experiment more about motion and force.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-09-09T05:51:02.067Z"
        }
      ]
    }
  ]
}