{
  "generatedAt": "2026-02-05T15:07:51.989Z",
  "day": "2025-10-27",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-10-27",
          "title": "Reading The story this week is 'Patterns in Nature. Please watch the video until you understand the story. https://ww…",
          "details": "Reading The story this week is 'Patterns in Nature. Please watch the video until you understand the story. https://www.youtube.com/watch?v=Aph1JPFkeXc The spelling test is on Wednesday! nature patterns repeat sequence symmetry backyard twig arranged sets series rainbow seasons cocoon snowflakes beautiful Complete all your AR reading quizzes for your library books! Bookaween Homework For Bookaween, we will present our book on stage next Thursday. Please ensure you memorize your part and practice reading it with power and expression. We will practice the whole book together during class. The cover and first page are finished—great work, everyone! Only two students still need to give me their two pages of the book. Please bring them tomorrow. Today’s homework: Remember and act out your part of the story. Practice your voice, facial expressions, and gestures to entertain the crowd. Let’s make our Bookaween performance fantastic! Playground Improvement Project – Homework This week’s project is titled 'Playground Improvement Project – Letter to the Mayor.' Go to your local playground and take a good look around. Think about what could be better—is there anything that should be safer, cleaner, or more fun? Take notes and take a few pictures or make drawings of the areas that need improvement. Then, write a letter to your apartment management or the mayor explaining what you think should change and why. You can use the sample letter on the worksheet to help you. What to do: Visit your playground and write down what you like and what could be improved. Take photos or draw the parts that need fixing or cleaning. Write your ideas in the worksheet (sections 1–3). Type or neatly write your final letter on a separate A4 page and attach your pictures or drawings. Due Date: Thursday Extra reading Please go to ReadWorks and complete some of the stories assigned. They will help you with you work in school and also improve your overall reading. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math Complete Additional Practice 5-2 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Language Arts Complete pages 62-63 in the Vocabulary workshop book. Social Studies Read pages 72-75 Science Homework – Water Cycle Project For our next science lesson, we will make a Water Cycle Project. Please bring the following items on Wednesday: One medium-sized clear ziplock bag (not too big, so it can fit on the window) A name pen (to write your name on the bag) You don’t need to bring coloring materials—I already have them. We will make our water cycle bags, tape them to the window, and watch what happens when it gets hotter and colder. Korean Page 80-81 and 120-131\n\nA practice Microphone! Does anyone have a toy microphone we can use this week to practice for the Bookaween presentation? I am not sure where mine is! Thanks! Also don't forget your library books and quizzes by tomorrow!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-10-27T11:35:27.764Z"
        }
      ]
    }
  ]
}