{
  "generatedAt": "2026-02-05T15:07:51.996Z",
  "day": "2025-12-06",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-12-06",
          "title": "Upcoming Tests Social Studies Chapter 3 December 10th (pages 84-136) Math Topic 7 December 11th Reading Complete up t…",
          "details": "Upcoming Tests Social Studies Chapter 3 December 10th (pages 84-136) Math Topic 7 December 11th Reading Complete up to page 96 in the practice workbook. The story this week is Nature's patchwork quilt https://www.youtube.com/watch?v=6u5Y_Ln2imI The spelling test is next Thursday! Please look at the vocabulary every day! interdependence food chain camouflage adaptations quilt patchwork stitched unique niche roots shrimp seashore shallow Arctic ancestors Extra reading ( I have added some new stories) TO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS Please go to ReadWorks and complete some of the stories assigned. They will assist you with your schoolwork and also enhance your overall reading skills. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it. Math Complete Additional Practice 7-5 (Student book and homework book) I have added New Khan Academy lessons related to data. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Hi Data Detectives! 🕵️‍♂️✨ For tonight: You have already collected your data in class. Now it’s time to create your Math Poster! Homework Reminder Your poster should include: • Your frequency table • A picture graph • A bar graph • Information about what your data shows (what you learned from the results) Decorate your poster based on your topic! • K-Pop → pictures and colors 🎤🎶 • Animals → animal images 🐶🦊 • Sports → balls, jerseys, and equipment ⚽🏀 • Or anything related to your question! Make it neat, colorful, and fun to read! This is due on Monday. I can’t wait to see your amazing math projects! 🌟 Language Arts Grammar Workshop 94-95 (Tuesday) Vocabulary Workshop 82-83(Tuesday) 1 Free journal Chinese Memorise the worksheet given in class by Next Tuesday. Korean Complete 218-229 Social Studies (Monday) Read and complete pages 124-131 in the textbook (DUE MONDAY) Please prepare for the test by either playing the blooket - https://play.blooket.com/play?hwId=692fc31a0092a8bf0f16391f and/or reading pages 84-136 https://www.youtube.com/watch?v=0JYvYiulaXw https://www.youtube.com/watch?v=vd0fMpAIs1s https://www.youtube.com/watch?v=jsTB7gSfDPI",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-12-05T16:12:14.337Z"
        }
      ]
    }
  ]
}