{
  "generatedAt": "2026-02-05T15:34:33.607Z",
  "day": "2025-09-08",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-09-08",
          "title": "Reading\n\nComplete this week's definition paper. (Due Wednesday). Please choose 3 of the words and make a complete sen…",
          "details": "Reading\n\nComplete this week's definition paper. (Due Wednesday). Please choose 3 of the words and make a complete sentence.\n\nThe next story in the book is Cocoliso\n\nhttps://www.youtube.com/watch?v=aGrbVelGJOI \n\nPlease watch the video and become familiar with the story.\n\nThe spelling words for next week are \n\naim\naware\ndefeat\ndrift\nmild\npause\nrefuse\nroute\nruin\nsolid\n\nPlease revise them before next Friday.\n\nI have assigned 7 fables for you to complete in ReadWorks. Please work on them over the next two weeks. They should all be complete this week.\n\n Go to www.readworks.org/student \n\nEnter our class code YU6GQ2\nYour password is 1234 unless you already changed it\nTake your time, do your best reading, and enjoy the stories.\n\nPLEASE TRY YOUR BEST TO LOG IN AND GIVE AN ANSWER. PLEASE DO NOT WRITE KOREAN OR WRITE ‘I DON’T KNOW’\n\nMath\n\nComplete the red assessment pages of the math book. \n\n(Please remember that these questions are similar to the test that we will take on Wednesday)\n\nPlease have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills.\n\nYou can also try Khan Academy for grades 4 and 5 if you want more challenges. Please do this after completing grade 3 work.\n\nThe cops and robbers math game is attached!\n\nKorean \n\nActivity book - 6-17\nTextbook - 64-65\n\nScience\n\nTo complete page 25 in the book, we need:\n\na steel ball / \nsome magnets / \na straw\n\nIf you have any of these items, please bring them on Wednesday.\n\nLanguage Arts\n\nMake sure 24-27 is completed in the Grammar Workshop book.\n\nSocial Studies\n\nReadWorks Assignment 5/6 – Tropical Rainforests / Natural Disasters (8 stories)\n\nI have assigned a story on Rainforest and 8 stories about natural disasters on ReadWorks.\n\n Go to www.readworks.org/student \n\nEnter our class code YU6GQ2\nYour password is 1234 unless you already changed it\nTake your time, do your best reading, and enjoy the stories.\n\nTry to complete these in the next 2 WEEKS!\n\nLibrary\n\n Tomorrow is library day! Make sure you have read all your books, brought them to school, and completed the AR quizzes.\n\nJust for fun!\n\nIt was Ian Choi's Birthday. Here is his quiz!\n\nPlease do after all the other homework\n\nhttps://play.blooket.com/play?hwId=68be7670ccada9b7bae743fe\n\nThanks for all the food and presents Ian!\n\nHave a great evening!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-09-08T06:28:18.644Z"
        }
      ]
    }
  ]
}