{
  "generatedAt": "2026-02-05T15:07:51.995Z",
  "day": "2025-12-01",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-12-01",
          "title": "Winter Festival Countdown! Get Ready to Shine at the Winter Festival Winter Festival Practice Reminder Less than 2 we…",
          "details": "Winter Festival Countdown! Get Ready to Shine at the Winter Festival Winter Festival Practice Reminder Less than 2 weeks to go—Let’s Get Festival Ready! Time to Practice for the Winter Festival! The video is below! Reading Complete up to page 365 in the My View Book Complete the definition paper. Please find the words in the story. The story this week is Welcome Back Wolves. https://www.youtube.com/watch?v=h5ZXpqMFQy0 The spelling test is on Friday! Please look over them every day! habitat solitary multiplied plentiful government threatened livestock decades biodiversity ecosystem negatives myth tourism outweighs risks Extra reading ( I have added some new stories) TO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS Please go to ReadWorks and complete some of the stories assigned. They will assist you with your schoolwork and also enhance your overall reading skills. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it. Math Complete Additional Practice 7-1 (Student book and homework book) I have added New Khan Academy lessons related to data. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science (Wednesday) Please complete 134-135 in the science textbook Social Studies (tomorrow) Read and complete pages 112-117 in the textbook Language Arts Grammar Workshop - 86-87 Spanish Write the Spanish words of the song Golden Chinese Complete the worksheet given in class by tomorrow",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-12-01T06:47:00.260Z"
        }
      ]
    }
  ]
}