{
  "generatedAt": "2026-02-05T15:14:27.892Z",
  "day": "2025-08-29",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-08-29",
          "title": "Reading ReadWorks Assignment 4 – Fables I have assigned 7 fables for you to complete in ReadWorks. Please work on the…",
          "details": "Reading ReadWorks Assignment 4 – Fables I have assigned 7 fables for you to complete in ReadWorks. Please work on them over the next two weeks. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Take your time, do your best reading, and enjoy the stories. The next story video is https://www.youtube.com/watch?v=cccG9bMOfiY Please watch the video until you fully understand The spelling words for next week are: preparations magnificent brooded rejoicing satisfied gigantic flood weary darkness politely chest spilled scold sighed sparkling Math Complete Additional Practice 2-1 (also 2-1 in the student's book) Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Language Arts Science Complete the lesson quiz on motion. Language Arts Complete pages 14-15 in the Vocabulary Workshop book https://www.sadlierconnect.com/anonymous/view-resource/vw?limitProgramTocIds=&productId=35&programSeriesId=1&programTocId=3219&resourceId=81969&hash=dW5kZWZpbmVk Example Journal This weekend was really fun. On Saturday, my family came to MCA for the Open House. I was so excited to show my parents our classroom. I showed them my desk, my storybook project, and even where I sit during reading time. My mom said our classroom looked bright and colorful, and my dad liked the posters on the wall. I felt proud when they smiled at my work. In the afternoon, we went to a kids café. It was noisy with children laughing and running around. I jumped into the big ball pit, and the plastic balls felt cool and bumpy on my arms. I also tried the slide, and it was so fast that my stomach felt ticklish when I went down. On Sunday, we went to the park to play with some other families. The air smelled fresh, and I could hear birds chirping in the trees. I played tag with my friends until my legs felt tired. In the evening, we had pizza for dinner. The cheese was gooey and hot, and the crust was crunchy. I thought it was delicious and the best way to end the weekend. Writing Tips for Next Time 1) Check your spelling carefully. 2) Use the past tense since you are writing about what already happened. 3) Make sure you have a clear beginning, middle, and ending. 4) Choose one exciting thing and add more details. 5) Use sensory words like what you saw, heard, smelled, felt, or tasted. 6) Add your emotions so readers know how you felt. Spanish Homework All about me worksheet test. Next Thursday!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-08-29T05:50:05.106Z"
        }
      ]
    }
  ]
}