{
  "generatedAt": "2026-02-05T15:07:51.985Z",
  "day": "2025-10-02",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-10-02",
          "title": "It’s Chuseok! 🌕✨ This is a special time for families, so I’ve kept homework to a minimum. I hope you can enjoy relax…",
          "details": "It’s Chuseok! 🌕✨ This is a special time for families, so I’ve kept homework to a minimum. I hope you can enjoy relaxing with your loved ones, making happy memories, and coming back to school refreshed and ready to learn. The homework list below is mostly a reminder of what should already have been finished before the holiday. The only new assignment is the Chuseok journal, where you can write about your holiday experiences. If you’d like some extra practice, you can always use Khan Academy or ReadWorks. Have a wonderful Chuseok with your family! 🌸 Chuseok Language Arts Homework For this holiday, your homework is to write at least one Chuseok journal entry before you come back to school. You can write more than one if you want! Remember: Use the past tense because Chuseok already happened. Try to compare it with this week’s future journal (what you thought would happen vs. what actually happened). Add sensory details: what you saw, heard, smelled, tasted, and felt. Keep it interesting—focus on special or fun moments, not just a list of events. Organize your writing with a clear beginning, middle, and ending. You can include one or two similes to make your writing more vivid, for example: “as bright as the full moon” or “like a quiet song.” Example Journal (Mr. Smith’s Chuseok) Chuseok is a wonderful time to celebrate family, food, and traditions. This year, I had a mix of rest, fun, and special family moments. First, I stayed at home and finally had time to rest. I also organized my things because my room was such a mess, and cleaning it made me feel as free as a bird. One day, I went to Seoul and visited a beautiful palace. After that, I walked along Cheonggyecheon Stream, which was peaceful and cool like a quiet song. Later, I enjoyed a picnic at the Han River with my family I also visited my parents-in-law’s house, where we ate lots of delicious homecooked food. We played the traditional game Yutnori together, and everyone laughed and cheered. Another day, I went to some events with my three kids. Spending quality time with them was as bright and joyful as the Chuseok full moon. Chuseok gave me many good memories, and I came back feeling grateful and refreshed. I hope everyone else had a wonderful holiday too, and I am ready to return to school after the break. Extra reading For Chuseok, I have assigned some extra ReadWorks passages with stories about how people celebrate their culture. Please log in when you have time to practice and boost your reading skills. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math Complete Additional Practice 4-3 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Read and complete 56-65 in the Science Textbook. Watch the video to understand the lesson today. https://www.youtube.com/watch?v=OQG83UvXn3w https://www.youtube.com/watch?v=Dx3RpXdJw2k Korean Study for the test in the next class. Chinese There will be a Chinese Test in the next class. Social Studies Learn About Goods and Services https://www.youtube.com/watch?v=Jd4kD9TicbA Take the goods and services quiz. How many did you get correct? https://www.youtube.com/watch?v=_CV7FWP5Oqo I have assigned a story on Readworks - Buying, Selling, and Trading Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Please try your best to complete these assignments to help your reading grow! Please answer every question and SUBMIT.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-10-02T05:38:02.695Z"
        }
      ]
    }
  ]
}