{
  "generatedAt": "2026-02-05T15:14:27.891Z",
  "day": "2025-08-21",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-08-21",
          "title": "Reading Complete pages 50-52 in the MY View Reading Book (we completed most of this in class) Please watch the video …",
          "details": "Reading Complete pages 50-52 in the MY View Reading Book (we completed most of this in class) Please watch the video if you need help. https://www.youtube.com/watch?v=hLASwjg7fQo Watch the videos about similes https://www.youtube.com/watch?v=89iv4Y2Ulh8 https://www.youtube.com/watch?v=Y7jN3XuRLHI Syllable Division videos https://www.youtube.com/watch?v=hOM7SQdrNt8 https://www.youtube.com/watch?v=ikFsUf8rRrw Complete the AR quiz for Grandma and the great gourd. You can log in and search for the title, and take the quiz. If you are not sure of the story, please read or watch the video again. Readworks Assignment 2 - The Star Maiden: An Ojibway Legend 1. Have students go to www.readworks.org/student 2. Students enter class code YU6GQ2 3. Tell your students that their default password is 1234 The spelling test words for this Friday are fierce baring flexing crouching swipe hut chores skinny sleek fertilizer gourd dizzy paw drolling lentils Please prepare for the test TOMORROW Math Complete Additional Practice 1-4 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Language Arts Complete Pages 10-11 in the vocabulary workshop book. (Due in the next LA class (tomorrow) We will act out the Hare and the Tortoise Next week on FRIDAY (29th) in the Piazza. Please remember your lines and talk to your partner about how you want to act out the role play. Social Studies 📘 Social Studies Project Homework (DUE AUG 27th) We are starting our first Social Studies project! 🎉 Each student will choose 1 country (not Korea, since we are learning about other countries) and 1 city in that country. They will create a poster on A3 paper that includes the following: Physical Geography – mountains, rivers, lakes, deserts, forests Human Geography – population, celebrations, foods, famous buildings or landmarks Other Important Facts – language, currency, country flag, a map of the country and the city, any other interesting facts you would like to share The poster should be bright, colorful, and creative so we can decorate our classroom with them. Each student will present their poster to the class next week for about 1–2 minutes. ➡️ This project is due next Wednesday. Readworks Assignment 3 Our world 1. Have students go to www.readworks.org/student 2. Students enter class code YU6GQ2 3. Tell your students that their default password is 1234",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-08-21T04:30:40.122Z"
        }
      ]
    }
  ]
}