{
  "generatedAt": "2026-02-05T15:14:27.901Z",
  "day": "2025-11-19",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-11-19",
          "title": "Upcoming Tests Science - Topic 3 - Weather - November 26th Math - Topic 6 - Area - November 26th World Heritage Day –…",
          "details": "Upcoming Tests Science - Topic 3 - Weather - November 26th Math - Topic 6 - Area - November 26th World Heritage Day – Final Reminder Tomorrow is World Heritage Day! When you arrive, please use the morning to put the final touches on your Ireland booth. After that, you will be teaching visitors about Ireland, so please ensure you have prepared something to say and are familiar with the information you will be teaching. If you'd like to give a prize, please bring some small candies. Any Irish food must arrive before 10 a.m. Come prepared, work as a team, and have fun showcasing Ireland! Korean Complete pages 190-202 Reading The story this week is 'Wolf Island.\" https://www.youtube.com/watch?v=N6LsBdRnboI&t=10s The spelling test next Friday is depended well-being population available balance meadows pups curious sniffed howled mainland scrambled mild gnawed returned Extra reading ( I have added some new stories) TO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS Please go to ReadWorks and complete some of the stories assigned. They will assist you with your schoolwork and also enhance your overall reading skills. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it. Math Complete Additional Practice 6-6 I have added New Khan Academy related to area. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Complete pages 120-123 in the science book to prepare for the test next week. Here is a blooket that will help with the science test next week. https://play.blooket.com/play?hwId=691d63229e44a5b1ad11c612 Language Arts Vocabulary Workshop - 72-73 Grammar Workshop - 78-79 Spanish Write the Spanish words of the song Golden https://www.youtube.com/watch?v=DMd18zBUbM0&list=RDDMd18zBUbM0&start_radio=1",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-11-19T06:28:53.178Z"
        }
      ]
    }
  ]
}