{
  "generatedAt": "2026-02-05T15:34:33.607Z",
  "day": "2025-09-05",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-09-05",
          "title": "Upcoming Test\n\nThe Topic 2 Math test is on Wednesday, September 10th. Please make sure to revise for the test and loo…",
          "details": "Upcoming Test\n\nThe Topic 2 Math test is on Wednesday, September 10th. Please make sure to revise for the test and look back on all of topic 2. \n\nReading\n\nThe next story in the book is Cocoliso\n\nhttps://www.youtube.com/watch?v=aGrbVelGJOI \n\nPlease watch the video and become familiar with the story.\n\nThe spelling words for next week are \n\naim\naware\ndefeat\ndrift\nmild\npause\nrefuse\nroute\nruin\nsolid\n\nPlease revise them before next Friday.\n\nI have assigned 7 fables for you to complete in ReadWorks. Please work on them over the next two weeks.\n\n Go to www.readworks.org/student \n\nEnter our class code YU6GQ2\nYour password is 1234 unless you already changed it\nTake your time, do your best reading, and enjoy the stories.\n\nMath\n\nComplete Additional Practice 2-6\nPlease have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills.\n\nScience\n\nComplete the science worksheet on pattern in motion.\n\nLanguage Arts\n\nComplete pages 26-27 in the Grammar Workshop book\n\n1 more Free Journal\n\nTips for Writing Your Journal\n\nChoose one main topic. Write in the past tense. Use sensory words such as what you saw, heard, smelled, touched, and tasted. Have a clear structure with a beginning to introduce what you did, a middle with details and sensory words, and an ending to explain how you felt or why it was special. Try to stretch your ideas by giving more information about one exciting part instead of listing too many different things.\n\nExample Journal \n\nMy Weekend \nOn Saturday, I went on a multicultural family trip to meet other families in my neighborhood. We made things with clay, and I felt the soft, cool clay squish between my fingers. I saw bright colors and smelled the earthy scent of the clay. Everyone laughed and talked, and I heard the gentle tapping of tools on the clay. After that, we rode some horses. The horses’ warm fur brushed against my legs, and I felt my heart beat fast as we trotted around. I heard the hooves clopping on the ground and the wind whooshing past my ears.\nOn Sunday, I spent time with my three kids. We went to the playground, and I heard the swings creak as they moved back and forth. I felt the rough ropes when I pushed the swings. The air was warm, and I heard the laughter of my children playing. Later, we visited the Catholic church to pray. The church smelled faintly of candles, and the sunlight shone through the colorful stained-glass windows. I listened quietly to the soft singing and felt calm and peaceful inside. After church, we had dinner outside. I tasted delicious grilled food, and I felt happy sharing the meal together.\n\nThis weekend was special because I met new families on Saturday and spent time with my children on Sunday.\n\nSocial Studies\n\nPages 14-17 should be completed in the Social Studies Book.\n\nReadWorks Assignment 5 – Tropical Rainforests\n\nI have assigned a story about the rainforests on ReadWorks. Please complete it this week.\n\n Go to www.readworks.org/student \n\nEnter our class code YU6GQ2\nYour password is 1234 unless you already changed it\nTake your time, do your best reading, and enjoy the stories.\n\nSpanish \n\nNext week there will be a test in Spanish. Please learn the numbers 1-30.\n\nKorean\n\n P41 - 43 (Check the board in school)\n\nJust for fun \n\nIt was Jiwoo’s birthday today so we had a quiz all about Jiwoo and dolphins!\n\nIf you want to play more here is the link!\n\nhttps://play.blooket.com/play?hwId=68ba3a8f3b862182935e2a49",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-09-05T04:53:59.017Z"
        }
      ]
    }
  ]
}