{
  "generatedAt": "2026-02-05T15:14:27.894Z",
  "day": "2025-09-16",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-09-16",
          "title": "Upcoming Tests Friday, September 19 - Science Topic 1 test Tuesda,y September 23rd - Language Arts - Grammar Workshop…",
          "details": "Upcoming Tests Friday, September 19 - Science Topic 1 test Tuesda,y September 23rd - Language Arts - Grammar Workshop Unit 1 L1-8 Monday, September 29th - Social Studies - Topic 1 Reading. Complete pages 116-119 in my view book Complete the definition paper (DUE TOMORROW) The current story in the book is Cocoliso https://www.youtube.com/watch?v=aGrbVelGJOI Please watch the video and become familiar with the story. I have assigned a story on American Crocodiles Please complete BEFORE FRIDAY! Some students did not submit their answers. Please answer every question and SUBMIT. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it PLEASE TRY YOUR BEST TO LOG IN AND GIVE AN ANSWER. PLEASE DO NOT WRITE KOREAN OR WRITE ‘I DON’T KNOW’ The spelling words for next week are dream amazing bored discovery proud pilot swamp mammals hummingbird shortcut clinic manatee crocodile rare scientist Please revise them before Friday. You borrowed some new books from the library. Please try to have a regular reading pattern and complete the AR quizzes after you read each book. Math Complete Additional Practice 3-4 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Some people have not logged into Khan Academy! Please make this part of your daily routine. Social Studies Read and complete pages 32-35 in the Social Studies Book ReadWorks Assignment 5/6 – Tropical Rainforests / Natural Resources (8 stories) I have assigned a story on Rainforest and 8 stories about natural disasters on ReadWorks. Please complete it within the next 2 weeks. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Chinese Learn the vocabulary before the next Chinese class. The words are student / boy / girl In Chinese Science Read and complete pages 34-39 Here is a blooket you can practice for the test! The questions are similar to the test. https://play.blooket.com/play?hwId=68c78a9e9a08a844bb252aab This Friday is the science test! To prepare, you need to read all the pages related to forces and motion (Pages 6-49) Korean Page 110-114 Language Arts Complete pages 32-33 in the Vocabulary Workshop book (Due Thursday) What's the Word? https://www.sadlierconnect.com/anonymous/view-resource/vw?limitProgramTocIds=&productId=35&programSeriesId=1&programTocId=3223&resourceId=81985&hash=dW5kZWZpbmVk Word Search https://www.sadlierconnect.com/anonymous/product/vw?productId=35&programId=259&subjectId=1&gradeId=6&programTOCId=3223&programSeriesId=1&hash=dW5kZWZpbmVk",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-09-16T06:46:46.334Z"
        }
      ]
    }
  ]
}