{
  "generatedAt": "2026-02-05T15:14:27.896Z",
  "day": "2025-09-30",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-09-30",
          "title": "ReadingThe story this week is 'Living in Deserts' Please watch the video until you understand the story. https://www.…",
          "details": "ReadingThe story this week is 'Living in Deserts' Please watch the video until you understand the story. https://www.youtube.com/watch?v=NxDlziHeNdg The spelling words for Next Thursday are: shield lack exposure nomadic landscape extreme drowned heatstroke protect conditions traditional climate oasis barren pollution I have assigned a story on What Lives in the Deserts? (DUE LAST FRIDAY) I have assigned a story on Learning About the Sun ( DUE AFTER CHUSEOK) Please try your best to complete these assignments to help your reading grow! Please answer every question and SUBMIT. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math Complete Additional Practice 4-2 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Read and complete 56-65 in the Science Textbook. Watch the video to understand the lesson today. https://www.youtube.com/watch?v=OQG83UvXn3w https://www.youtube.com/watch?v=Dx3RpXdJw2k Korean Study for the test in the next class. Chinese There will be a Chinese Test in the next class. Social Studies Learn About Goods and Services https://www.youtube.com/watch?v=Jd4kD9TicbA Take the goods and services quiz. How many did you get correct? https://www.youtube.com/watch?v=_CV7FWP5Oqo I have assigned a story on Readworks - Buying, Selling, and Trading Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Please try your best to complete these assignments to help your reading grow! Please answer every question and SUBMIT.\n\nScience Museum Trip – Reminder Tomorrow is our trip to the Gwacheon Science Museum! Please remember to: Wear your MCA T-shirt Bring a water bottle Pack some snacks Bring a small bag for your things At the museum, you’ll find lots of hands-on exhibits you can touch, explore, and experiment with. There are halls about space, technology, nature, and even an outdoor area with cool displays. If the weather is nice, we’ll also spend some time in the playground before coming back to school. It’s going to be a fun day of learning and discovery together! Let's have a day of learning and bonding!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-09-30T07:00:38.324Z"
        }
      ]
    }
  ]
}