{
  "generatedAt": "2026-02-05T15:34:33.607Z",
  "day": "2025-09-10",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-09-10",
          "title": "SCIENCE CLASS\n\nToday in science we explored  and . We carried out experiments using magnets and blowing air to put ob…",
          "details": "SCIENCE CLASS\n\nToday in science we explored  and . We carried out experiments using magnets and blowing air to put objects into motion. After that, we had some races and finished off with a game to demonstrate how magnetic fields work as a non-contact force. It was a fun and hands-on way to learn about forces and motion!\n\nMAP TESTING\n\nMAP testing is coming up from September 22–26. If you are going to be absent on any of those days, please let me know so we can arrange for you to take the test early.\n\nTo prepare for math, you can practice on Khan Academy. For reading, you can use ReadWorks, take AR quizzes, and read as much as you can. For science and social studies, you can review your textbooks and read nonfiction books.\n\nLet’s all be ready and do our best.\n\nUpcoming Tests\n\nFriday, September 19 - Science Topic 1 test\nTuesday, September 23rd - Language Arts - Grammar Workshop Unit 1 L1-8\nMonday, September 29th - Social Studies - Topic 1\n\nSpanish \n\nTomorrow there will be a test in Spanish. Please learn the numbers 1-30.\n\nhttps://www.youtube.com/watch?v=A_Uq4BuFqHY  \n\nReading.\n\nToday we learned about the layers of the rainforest. We started a teamwork poster to show the 4 layers of the rainforest.\n\nhttps://www.youtube.com/watch?v=blh3Kq9xf_o \n\nTomorrow you will complete the poster. Please bring some things to decorate your poster. You can print some pictures or bring some bright, colorful things to make your poster bright and interesting.\n.\n\nThe next story in the book is Cocoliso\n\nhttps://www.youtube.com/watch?v=aGrbVelGJOI \n\nPlease watch the video and become familiar with the story.\n\nThe spelling words for next week are \n\naim\naware\ndefeat\ndrift\nmild\npause\nrefuse\nroute\nruin\nsolid\n\nPlease revise them before Friday.\n\nI have assigned 7 fables for you to complete in ReadWorks. Please work on them over the next two weeks. They should all be complete this week.\n\n Go to www.readworks.org/student \n\nEnter our class code YU6GQ2\nYour password is 1234 unless you already changed it\nTake your time, do your best reading, and enjoy the stories.\n\nPLEASE TRY YOUR BEST TO LOG IN AND GIVE AN ANSWER. PLEASE DO NOT WRITE KOREAN OR WRITE ‘I DON’T KNOW’\n\nYou borrowed some new books from the library. Please try to have a regular reading pattern and complete the AR quizzes after you read each book. \n\nMath\n\nWELL DONE ON COMPLETING THE MATH TEST TODAY\n\nTonight please log-in and complete 20-30 mins of Khan Academy\n\nhttps://www.khanacademy.org/join/VK6QDS9E \n\nYou can also try Khan Academy for grades 4 and 5 if you want more challenges. Please do this after completing grade 3 work.\n\nSocial Studies\n\nRead and complete pages 28-31 in the social studies book.\n\nReadWorks Assignment 5/6 – Tropical Rainforests / Natural Resources (8 stories)\n\nI have assigned a story on Rainforest and 8 stories about natural disasters on ReadWorks. Please complete it within the next 2 weeks.\n\n Go to www.readworks.org/student \n\nEnter our class code YU6GQ2\nYour password is 1234 unless you already changed it\n\nScience\n\nToday we had a fun time learning about contact force and non-contact force. To embed the learning, please watch the following videos.\n\nhttps://www.youtube.com/watch?v=5-2NLHB4Gxg \n\nhttps://www.youtube.com/watch?v=NmEb6DEZQJs \n\nChinese\n\nComplete the Chinese writing.\n\nChinese test next Tuesday.\n\nKorean \n\nActivity book - 6-17\nTextbook - 64-65",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-09-10T07:03:54.635Z"
        }
      ]
    }
  ]
}