{
  "generatedAt": "2026-02-05T15:07:51.978Z",
  "day": "2025-09-08",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-09-08",
          "title": "Reading Complete this week's definition paper. (Due Wednesday). Please choose 3 of the words and make a complete sent…",
          "details": "Reading Complete this week's definition paper. (Due Wednesday). Please choose 3 of the words and make a complete sentence. The next story in the book is Cocoliso https://www.youtube.com/watch?v=aGrbVelGJOI Please watch the video and become familiar with the story. The spelling words for next week are aim aware defeat drift mild pause refuse route ruin solid Please revise them before next Friday. I have assigned 7 fables for you to complete in ReadWorks. Please work on them over the next two weeks. They should all be complete this week. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Take your time, do your best reading, and enjoy the stories. PLEASE TRY YOUR BEST TO LOG IN AND GIVE AN ANSWER. PLEASE DO NOT WRITE KOREAN OR WRITE ‘I DON’T KNOW’ Math Complete the red assessment pages of the math book. (Please remember that these questions are similar to the test that we will take on Wednesday) Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. You can also try Khan Academy for grades 4 and 5 if you want more challenges. Please do this after completing grade 3 work. The cops and robbers math game is attached! Korean Activity book - 6-17 Textbook - 64-65 Science To complete page 25 in the book, we need: a steel ball / some magnets / a straw If you have any of these items, please bring them on Wednesday. Language Arts Make sure 24-27 is completed in the Grammar Workshop book. Social Studies ReadWorks Assignment 5/6 – Tropical Rainforests / Natural Disasters (8 stories) I have assigned a story on Rainforest and 8 stories about natural disasters on ReadWorks. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Take your time, do your best reading, and enjoy the stories. Try to complete these in the next 2 WEEKS! Library Tomorrow is library day! Make sure you have read all your books, brought them to school, and completed the AR quizzes. Just for fun! It was Ian Choi's Birthday. Here is his quiz! Please do after all the other homework https://play.blooket.com/play?hwId=68be7670ccada9b7bae743fe Thanks for all the food and presents Ian! Have a great evening!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-09-08T06:28:18.644Z"
        }
      ]
    }
  ]
}