{
  "generatedAt": "2026-02-05T15:14:27.898Z",
  "day": "2025-11-03",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-11-03",
          "title": "Upcoming Tests Social Studies Chapter 2 - Wednesday, Nov 5th (Pages 45-82) (I gave 1 more day as some people have bee…",
          "details": "Upcoming Tests Social Studies Chapter 2 - Wednesday, Nov 5th (Pages 45-82) (I gave 1 more day as some people have been sick) Math - Topic 5 - Tuesday, Nov 11th Reading Complete 254-255 in the reading textbook The story this week is 'Patterns in Nature. Please watch the video until you understand the story. https://www.youtube.com/watch?v=Aph1JPFkeXc Definitions Paper is due on WEDNESDAY. The spelling test is on THURSDAY this week! border certain clasp depart fierce journey observe superb treasure wisdom Extra reading Please go to ReadWorks and complete some of the stories assigned. They will help you with your work in school and also improve your overall reading. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math Complete Additional Practice 5-5 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Complete the Lesson Quiz about weather and water. (WEDNESDAY) Read and complete pages 90-96 in the science book Language Arts Please get to Page 63 in the grammar workshop and vocabulary workshop book (This is due NEXT TUESDAY) https://www.sadlierconnect.com/anonymous/view-resource/vw?limitProgramTocIds=&productId=35&programSeriesId=1&programTocId=3230&resourceId=82008&hash=dW5kZWZpbmVk https://www.sadlierconnect.com/anonymous/view-resource/gw?limitProgramTocIds=&productId=494&programSeriesId=3&programTocId=209&resourceId=287892&hash=dW5kZWZpbmVk Korean (MONDAY) Pages 103-105 and 137-139 Also finish to page 45 Social Studies The Social Studies test is on WEDNESDAY! I created a Blooket that is very similar to the test! https://play.blooket.com/play?hwId=69084d028a415e9fc58579eb Please try to play until you get the questions correct. Also, please complete the worksheet about Skills and Jobs given in class today. World Heritage Day (It is not long until it starts) Tomorrow we’ll start preparing our projects for World Heritage Day, so please spend some time researching information about Ireland and thinking of fun, hands-on activities that visiting students can do when they come to our class. Here’s a reminder of your groups: ☘️ Irish Language & Culture Team: Ian C, Alex, Noah 🎨 Irish Symbols & Landmarks Team: Woojoo, Jason, Siwoo 🎵 Irish Dance & Music Team: Stella, Jiwoo, Yujoo 🐉 Irish Myths, Animals & Legends Team: Jenny, Jey, Ian Sa Make sure your group has some solid ideas ready to share in class tomorrow—both for your poster and your activity. Be creative, have fun, and show off the best of Ireland! 🍀 I will sit with each group tomorrow and brainstorm ideas!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-11-03T07:56:32.412Z"
        }
      ]
    }
  ]
}