{
  "generatedAt": "2026-02-05T15:34:33.622Z",
  "day": "2025-10-16",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-10-16",
          "title": "Reading\n\nComplete pages 200-203 in the My View book.\n   \nThe story this week is 'Why sun & moon live in the sky. It i…",
          "details": "Reading\n\nComplete pages 200-203 in the My View book.\n   \nThe story this week is 'Why sun & moon live in the sky. It is a Myth. \n\nPlease watch the video until you understand the story.\n\nhttps://www.youtube.com/watch?v=BSAknmmJv1M \n\nThe spelling test for this FRIDAY is the following words:\n\natmosphere\nbrilliant\nconvince\nendure\nglance\nharsh\nplunge\nprecious\nswift\nunite\n\nLet’s Make Our Own Origin Myth! 🌏✨\n\nThese are your Origin Myth titles\n\n1) Jenny - Why did people choose Earth\n2) Ian C - Why the elephant has a long trunk\n3) Jason - Why are monkeys so smart\n4) Jiwoo - Why Orcas are strong and black\n5) Jey - How the starts twinkle\n6) Noah - Why the Komodo Dragon has strong poison\n7) Yujoo - Why - Why are foxes organge\n8) Stells - Why do squid have long legs\n9) Wj - Why are monkeys swift\n10) Siwoo - Why are turtles so slow\n11) Ian S - Why does the sun come out in the morning\n12) Alex - Why do sea otters wrap seaweed around their bodies\n\nTonights homework\n\nYou have all made a great start on your origin myths, and I was really impressed with your storytelling. Tonight, begin working on the final draft of your story and start decorating it. It should be presented on one side of an A4 paper so we can display it on the window for others to read.\n\nYou may type your story and decorate around it, or write it by hand using your best handwriting—just make sure it’s big enough for others to read easily. Tomorrow, you’ll have more time in the first class to continue working on it.\n\nI want to see vibrant colors to make your story come to life! You can add stickers, origami, or your own drawings. This will be graded as a project, and the final piece of work should be given to me on Tuesday, the 21st.\n\nExample Origin Myths\n\nHow the Firefly Got Its Light\nOnce, deep in a rainforest dripping with rain and echoing with frogs, there lived a tiny gray beetle who was always ignored. The butterflies showed off their colors, and the bees buzzed proudly about their honey, but the little beetle had nothing special.\n\nOne night, as he sat sadly by a puddle, a falling star splashed beside him. “You look dim,” said the star kindly. “Would you like a bit of my shine?”\n\nThe beetle nodded shyly, and the star touched his back. Suddenly, a golden glow burst from the beetle’s tail! He flew into the night, lighting the forest like a tiny lantern.\n\nFrom that night on, he shared his light with others who felt unseen—and that’s how fireflies came to sparkle across the dark forests every summer night.\n\nWhy Zebras Have Stripes\nLong ago, zebras were plain white and loved to roll in the mud. One hot day, a zebra found a cool, shiny black rock and lay down on it to rest. When he stood up, black lines covered his back! The other zebras thought he looked amazing and wanted lines too. They rolled and rolled across the rock until their bodies were covered in black stripes. Ever since then, zebras have worn their stripes proudly under the sun.\n\nWhy the Parrot Has Bright Feathers\nLong ago, all parrots were gray and dull. They lived quietly in the jungle trees, afraid of being noticed. One day, Rainbow, the sky painter, flew over the forest with buckets of color. She was in such a hurry to finish painting the sunset that she tripped over a tall tree—and\n\nRed, yellow, green, and blue paint rained down on the parrots below!\nThe parrots gasped when they saw their shiny new feathers. They squawked and danced and showed off their bright colors to every animal in the jungle.\n\nRainbow laughed and said, “You wear my colors better than the sky!”\n\nAnd ever since that day, parrots have been the most colorful birds in the world.\n\nExample Myth stories\n\nHow the rainbow was made\nhttps://www.youtube.com/watch?v=S2W42HzDo1A\n\nWhy the Sky is far away\nhttps://www.youtube.com/watch?v=mLmBR0s8TY8\n\nWhy the sea is salty\nhttps://www.youtube.com/watch?v=b7GJIzjXlJ4 \n\nExtra reading\n\nPlease go to ReadWorks and complete some of the stories assigned. They will help you with you work in school and also improve your overall reading.\n\nGo to www.readworks.org/student \n\nEnter our class code YU6GQ2\nYour password is 1234 unless you already changed it\n\nMath\n\nComplete Additional Practice 4-6\n\nPlease have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills.\n\nSocial Studies\n\nRead and complete pages 56-61 in the Social Studies test book.\n\nLanguage Arts\n\n50-51 should be finished in the Grammar Workshop book.\n\nWinter Festival Performance\n\nWe watched some fun dance videos today to get ideas for our Winter Festival performance. Below are a few of the videos we looked at. These are just for inspiration, so you don’t need to follow them exactly—just watch and get some creative ideas for your moves and energy.\n\nYou can watch each video at home to think about the style or choreography you like best.\n\n(Links will be added below.)\n\nJingle Bell Rock — fun and classic Christmas energy (1 minute)\n\nhttps://www.youtube.com/watch?v=-euxuPOGeEs (1)\nhttps://www.youtube.com/watch?v=Kaqgky-tm3A (x2) \n\nNeed to choose 1 of these!\n\nBallet Section (40 seconds)\n\nCarol of the Bells — graceful and dramatic ballet-style movement\n\nhttps://www.youtube.com/watch?v=0kVIMBip5yw \n\nSugar Plum Fairy  -   Magical, twinkly, gentle \n\nhttps://www.youtube.com/watch?v=jSABdMxupMI\n\nBolshoi Ballet | The Nutcracker -  Energetic, bouncy, joyful \n\nhttps://www.youtube.com/watch?v=1_vP7M0Cock\n\nNeed to choose 1 of these!\n\nSoda Pop — upbeat and modern K-pop style (30 seconds)\n\nhttps://www.youtube.com/watch?v=7doSPNWTAZU (59 sec-1:26sec)\n\nJust choose the chorus (30 seconds)\n\nThen big ending!\n\nWe could combine parts of these songs in our final performance, so have fun watching and imagining how they might connect together.\n\nPlease share any ideas you have so we can have a performance we all enjoy!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-10-16T08:26:29.320Z"
        }
      ]
    }
  ]
}