{
  "generatedAt": "2026-02-05T15:07:51.993Z",
  "day": "2025-11-17",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-11-17",
          "title": "Upcoming Tests Science - Topic 3 - Weather - November 26th Math - Topic 6 - Area - November 26th Social Studies World…",
          "details": "Upcoming Tests Science - Topic 3 - Weather - November 26th Math - Topic 6 - Area - November 26th Social Studies World Heritage Day – Ireland Project (THIS THURSDAY) Great job in class today working on your Ireland booth. Now it is time to finalize your ideas and prepare everything with your group. Your booth must include: A short teaching part (1 minute) A fun, hands-on activity (3–4 minutes) Green, white, and orange decorations Fair teamwork from everyone Wear green clothes The event is THIS THURSDAY, so you only have a few days left. This week, finish all details and make sure your group is fully prepared. On Tuesday, I need to see what each person in your group has completed, so please come ready to show your work. Important: When each team arrives, greet them with the Irish word “Dia dhuit” (hello). When they leave your booth, say “Slán” (goodbye). Give a short explanation and then move quickly into your activity. Talk within your teams so everyone knows exactly what they are doing. Remember: short facts + hands-on fun = the best booth! Korean Complete pages 190-202 Reading AR reading Quizzes by Tomorrow! Complete 324-329 in the My View Reading Book Complete the definition paper before WEDNESDAY The story this week is 'Wolf Island.\" https://www.youtube.com/watch?v=N6LsBdRnboI&t=10s The spelling test next Friday is depended well-being population available balance meadows pups curious sniffed howled mainland scrambled mild gnawed returned Extra reading ( I have added some new stories) TO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS Please go to ReadWorks and complete some of the stories assigned. They will assist you with your schoolwork and also enhance your overall reading skills. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it. Math Complete Additional Practice 6-4 I have added New Khan Academy related to area. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Complete the lesson quiz related to hazardous weather.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-11-17T06:59:18.407Z"
        }
      ]
    }
  ]
}