{
  "generatedAt": "2026-02-05T15:07:51.994Z",
  "day": "2025-11-24",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-11-24",
          "title": "Upcoming Tests Science - Topic 3 - Weather - November 26th Math - Topic 6 - Area - November 26th Winter Festival Coun…",
          "details": "Upcoming Tests Science - Topic 3 - Weather - November 26th Math - Topic 6 - Area - November 26th Winter Festival Countdown! Get Ready to Shine at the Winter Festival Winter Festival Practice Reminder 2 Weeks to Go—Let’s Get Festival Ready! Time to Practice for the Winter Festival! The video is below! Reading Definition Paper (TOMORROW) The story this week is Welcome Back Wolves. https://www.youtube.com/watch?v=h5ZXpqMFQy0 The spelling test next Wednesday is accuse clever coast delicate explore imitate pierce rare symbol triumph Extra reading ( I have added some new stories) TO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS Please go to ReadWorks and complete some of the stories assigned. They will assist you with your schoolwork and also enhance your overall reading skills. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it. Math (TOMORROW) Complete the reteaching and the red assessment pages (239-246). Remember, these red pages are very similar to the test on Wednesday! Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Social Studies Read and complete pages 96-101 Science Study for the test Science Textbook Pages 83-123 Here is a blooket that will help with the science test on Wednesday https://play.blooket.com/play?hwId=691d63229e44a5b1ad11c612 Language Arts Vocabulary Workshop - 74-77 Grammar Workshop - 82-83 Korean Page 186-187 and 207-209 Spanish Write the Spanish words of the song Golden https://www.youtube.com/watch?v=DMd18zBUbM0&list=RDDMd18zBUbM0&start_radio=1",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-11-24T06:40:14.839Z"
        }
      ]
    }
  ]
}