{
  "generatedAt": "2026-02-05T15:34:33.623Z",
  "day": "2025-11-07",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-11-07",
          "title": "Great job today, everyone!\n\nYou all did an amazing job on Sports Day — it looked like you had so much fun! Remember, …",
          "details": "Great job today, everyone!\n\nYou all did an amazing job on Sports Day — it looked like you had so much fun! Remember, it’s not about winning, it’s about taking part and doing your best.\n\nNext week, we have two tests:\n\nMath on Tuesday\nGrammar on Thursday\nPlease review all your previous homework and make sure your Math “Red” pages are finished.\n\nFor your journal, you have two choices:\n\nBookaween\nSports Day\n\nYou can choose one topic or write about both — it’s up to you1\n\nReading\n\nThe story this week is 'Weird Friends\" \n\nPlease watch the video until you understand the story.\n\nhttps://www.youtube.com/watch?v=ZdYQdzhaurc\n\nThe spelling test is next Friday!\n\npredators\nprotection\nimmune\nspecies\nemerges\ncluster\nsea anemone\ntentacles\nrhino\negret\nblind\nantennae \ndetect\nflee\npod\n\nExtra reading ( I have added some new stories)\n\nTO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS\n\nPlease go to ReadWorks and complete some of the stories assigned. They will help you with your work in school and also improve your overall reading.\n\nGo to www.readworks.org/student \n\nEnter our class code YU6GQ2\nYour password is 1234 unless you already changed it\n\nKorean (MONDAY)\n\nPages 103-105 and 137-139\nAlso finish to page 45\n\nSocial Studies\nWe need to make good progress on our World Heritage Day project this weekend. Ideas should start taking shape — make sure you have your photos printed and your games organized.\n\nThere isn’t much time left, so please take some time to prepare something fun and interesting with your group.\n\nThere isn’t much other homework, so please make sure to focus on your World Heritage project.\n\nHAVE A GREAT WEEKEND!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-11-07T10:02:31.410Z"
        }
      ]
    }
  ]
}