{
  "generatedAt": "2026-02-05T15:34:33.623Z",
  "day": "2025-10-29",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-10-29",
          "title": "Upcoming Tests\n\nSocial Studies Chapter 2 - Tuesday, Nov 4th (Pages 45-82)\n\nMath - Topic 5 - Tuesday, Nov 11th\n\nTomorr…",
          "details": "Upcoming Tests\n\nSocial Studies Chapter 2 - Tuesday, Nov 4th (Pages 45-82)\n\nMath - Topic 5 - Tuesday, Nov 11th\n\nTomorrow is Bookaween! \n\nWe will not have regular classes. Instead, we will do fun activities and have our presentation.\n\nYou can wear a costume. It’s best if it matches the story, but it’s okay if it doesn’t, as long as it does not include blood, weapons, or anything that might scare anyone.\n\nThere will be no more homework tomorrow, so enjoy the activities and the presentation!\n\nReading\n\nThe story this week is 'Patterns in Nature. \n\nPlease watch the video until you understand the story.\n\nhttps://www.youtube.com/watch?v=Aph1JPFkeXc \n\nBookaween (This is Tomorrow)\n\nPlease memorize your part and practice reading it with power and expression.\n\nTonight’s homework:\n\nTry your best to memorize your lines.\nThink of small actions you can do on stage to make your part more exciting.\nPractice reading slowly, clearly, and with expression.\nIf memorizing is difficult, you may bring a small piece of paper to help you.\n\nWhen others are speaking, you can smile and make small movements, but do not make sounds or take attention away from the reader.\n\nImportant:\n\nTomorrow is our Bookaweek presentation. Be ready to perform on stage and show your best reading and actions.\n\nPlayground Improvement Project – Homework (TOMORROW)\n\nThink about your local playground. What could be safer, cleaner, or more fun? Take notes, pictures, or make drawings.\n\nWrite a letter to your apartment management or the mayor about a problem in your playground and explain what should change and why. Use your best handwriting or type your letter. Write your final letter on an A4 page, with the letter in the middle and pictures or drawings around it, or pictures at the top and the letter below.\n\nBring your completed letter tomorrow. All letters will be displayed.\n\nExtra reading\n\nPlease go to ReadWorks and complete some of the stories assigned. They will help you with your work in school and also improve your overall reading.\n\nGo to www.readworks.org/student \n\nEnter our class code YU6GQ2\nYour password is 1234 unless you already changed it\n\nMath\n\nComplete Additional Practice 5-4 (MONDAY)\n\nPlease have your child practice a little Khan Academy math each night\n at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills.\n\nScience\n\nGreat work, everyone! We all have a water cycle display on the window to watch and learn from.\n\nThere is no other homework. Just watch the videos about the water cycle.\n\nhttps://www.youtube.com/watch?v=ncORPosDrjI\nhttps://www.youtube.com/watch?v=gBbFxl6Oy94 \nhttps://www.youtube.com/watch?v=TD3XSIE4ymo\nhttps://www.youtube.com/watch?v=Oq8iCsV4woE\n\nSocial Studies \n\nRead and complete pages 79-82 (MONDAY)\n\nPlease keep thinking of ideas for your World Heritage Day project!\n\nKorean\nPage 80-81 and 120-131 (MONDAY)",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-10-29T06:13:58.064Z"
        }
      ]
    }
  ]
}