{
  "generatedAt": "2026-02-05T15:14:27.896Z",
  "day": "2025-09-25",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-09-25",
          "title": "MAP TESTING Great job on completing three MAP tests already! I’ve seen so much effort and progress from everyone—well…",
          "details": "MAP TESTING Great job on completing three MAP tests already! I’ve seen so much effort and progress from everyone—well done! The last test will be Language Arts tomorrow. To get ready: Review your Grammar Workshop and Vocabulary Workshop books Practice finding the main idea and supporting details in short passages Think about word meanings—synonyms, antonyms, and using context clues Review the 8 parts of speech (noun, pronoun, verb, adjective, adverb, preposition, conjunction, interjection) Read carefully, do not rush, and check over your answers Remember, do not get stressed about the tests. They are just a way for us to see how you are doing and how we can help you. This is the final test—finish strong! These YouTube videos might be helpful 8 Parts of speech. https://www.youtube.com/watch?v=c3yJhw7R3fI https://www.youtube.com/watch?v=E4_flsnd65Y&list=RDE4_flsnd65Y&start_radio=1 These blookets might also help! Try to focus on the questions, not the game or just use the study mode with no games if you want to learn more Parts of speech https://play.blooket.com/play?hwId=68d4eb1d4a5d5ffc099a80d8 3rd Grade Language Arts https://play.blooket.com/play?hwId=68d4ed45fc347e5200e419fb Upcoming Class Tests! Monday, September 29th - Social Studies - Topic 1 Reading The story this week is 'Living in Deserts'. Please watch the video until you understand the story. https://www.youtube.com/watch?v=NxDlziHeNdg The spelling words for TOMORROW are: active bargain gasp loyal resource sensitive struggle value vary wander capture coward exclaim gloomy insist passage restless shallow shatter talent I have assigned a story on What Lives in the Deserts? (DUE FRIDAY) Please complete BEFORE TOMORROW! Please answer every question and SUBMIT. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math No book homework, but tomorrow is the math MAP test. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Korean Pages 115-119 and 20-33 in the Korean textbook and activity book. Chinese You need to write the words' student/boy/girl' twice before the next class. Language Arts Complete pages 36-41 in the Vocabulary workshop book.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-09-25T07:24:39.222Z"
        }
      ]
    }
  ]
}