{
  "generatedAt": "2026-02-05T15:07:51.987Z",
  "day": "2025-10-17",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-10-17",
          "title": "UpcomingTests Thursday, October 23rd -Math Topic 4 Friday, October 24th - Science Topic 2 Reading We have done a grea…",
          "details": "UpcomingTests Thursday, October 23rd -Math Topic 4 Friday, October 24th - Science Topic 2 Reading We have done a great job completing the book this week! No My View homework! The story this week is 'Why sun & moon live in the sky. It is a Myth. Please watch the video until you understand the story. https://www.youtube.com/watch?v=BSAknmmJv1M The spelling test for next Friday is: broadly foundation sturdy scales massive plenty dimmed invite enormous mud glittering squishy fur silvery spreads Let’s Make Our Own Origin Myth! 🌏✨ These are your Origin Myth titles 1) Jenny - Why did people choose Earth 2) Ian C - Why the elephant has a long trunk 3) Jason - Why are monkeys so smart 4) Jiwoo - Why Orcas are strong and black 5) Jey - How the starts twinkle 6) Noah - Why the Komodo Dragon has strong poison 7) Yujoo - Why - Why are foxes organge 8) Stells - Why do squid have long legs 9) Wj - Why are monkeys swift 10) Siwoo - Why are turtles so slow 11) Ian S - Why does the sun come out in the morning 12) Alex - Why do sea otters have pockets on their stomachs? This weekend's homework I am very impressed with all your work so far! For your project, make your story come to life with vibrant colors. You can add stickers, origami, or your own drawings to make it even more exciting. Important: On Monday, each of you will read your origin myth to the class, and we will talk about it together, so please make sure your story is ready and prepared. Then on Tuesday, the 21st, I will collect your final pieces and display them on the window for everyone to enjoy. Extra reading Please go to ReadWorks and complete some of the stories assigned. They will help you with you work in school and also improve your overall reading. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math Complete Additional Practice 4-8 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Social Studies Read and complete pages 56-61 in the Social Studies test book. Language Arts 54-55 should be finished in the Grammar Workshop book. Complete 1 more journal. Free! Hi everyone! Here are some tips to help you write a better journal: Write in the past tense for events that already happened. Make your journal easy to follow with a clear beginning, middle, and ending. Use descriptive words to show what you saw, heard, felt, smelled, or tasted—let your reader experience it with you. Avoid repeating the same information, because it can make your story less exciting. Check your spelling and remember to use capital letters and periods correctly. Vary your sentences and ideas to keep your story interesting and lively. Remember, the more you make your story exciting and detailed, the more fun it will be to read! Science Read and complete pages 66-77 in the science textbook. Watch the videos to embed the knowledge. https://www.youtube.com/watch?v=yXCeuSiTOug https://www.youtube.com/watch?v=7HHs98PBgk0 https://www.youtube.com/watch?v=tHIchO1pbFA",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-10-17T04:51:58.608Z"
        }
      ]
    }
  ]
}