{
  "generatedAt": "2026-02-05T15:07:51.990Z",
  "day": "2025-11-06",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-11-06",
          "title": "Today's Math Game Enjoy\n\nUpcoming Tests Math Topic 5 Tuesday, Nov 11th Grammar Workshop Unit 2 NOUNS (L9-14) Thursday…",
          "details": "Today's Math Game Enjoy\n\nUpcoming Tests Math Topic 5 Tuesday, Nov 11th Grammar Workshop Unit 2 NOUNS (L9-14) Thursday, Nov 13th World Heritage Day Preparation There isn’t much homework today or over the weekend, so please spend time working on your World Heritage Day – Ireland project. Some teams already have good ideas, but others need to talk more and make a clear plan. Use this time to think of a fun learning activity for the kids who will visit your booth. This project is an important part of your Social Studies grade, so please do your best and work together. Remember: Each team needs one board. Keep it neat and organized. Your booth should have: Something to teach (1–2 minutes) An activity (3–4 minutes) that visitors can try Talk with your team and decide who will bring pictures, make materials, write, or decorate. I will attach the activity ideas sheet again. You can use those ideas or make new ones. You can also add decorations around the classroom if you have time. World Heritage Day is on November 20th, so there are only two weeks left. Please think carefully this weekend and come to class on Monday ready to share your ideas. Also, if you plan to send in a food donation, please send the letter before November 13th so we can make sure we are organized. Reading Everyone should have completed up to page 66 in the workbook. (MONDAY) Extra reading ( I have added some new stories from the countries around the world) TO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS. I WILL BE CHECKING YOUR READING EFFORT. Please go to ReadWorks and complete some of the stories assigned. They will help you with your work in school and also improve your overall reading. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math (DUE MONDAY) Complete the red assessment pages! Remember, these pages are very similar to the test which is on TUESDAY! Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Korean (MONDAY) Pages 103-105 and 137-139 Also finish to page 45 Social Studies I need a clear plan for your World Heritage Day board and fun activity on MONDAY Language Arts (TUESDAY) Complete pages 68-69 in the grammar workshop book. This weekend, I would like a journal about the BOOKAWEEN day (if you were absent, you can write a general journal. Sample Journal Last week was Bookaween at MCA, and it was such an exciting time with the 3-1 class! Our class made a book called, and we presented it to everyone on the big stage. I felt a little nervous at first, but it was also exciting to perform. The gym was filled with bright lights, colorful costumes, and loud cheers—it felt like being in a real theater! After the presentations, we had lots of fun activities. We tossed rings, made Halloween crafts, and played outside in the cool, fresh air. The laughter and music made it feel like a big festival. The sweetest part of the day was when Principal Ms. Ryu gave us candy. It tasted as sweet as success after all our hard work. My cheeks were sore from smiling, and my hands were sticky from crafts, but my heart felt happy and proud. Bookaween with 3-1 was an amazing day full of fun, color, and teamwork. I’ll never forget how great it felt to share our story with everyone! Reminder! Remember to log into Khan Academy and Readworks a few times a week!\n\nWorld Heritage Day – Parent Notice Dear Parents, Today I sent home a letter about our World Heritage Day event, which will take place on Thursday, November 20. Please check your child’s bag for the letter and return the food donation form by Wednesday, November 13, if you would like to participate. Our class (3-1) will represent Ireland, and parents are invited to prepare one Irish dish to share (approximately 5–6 servings). Here are some Irish food ideas you can choose from: Mashed potatoes Potato pancakes (Boxty) Irish soda bread (with butter or jam) Scones Shortbread or butter cookies Apple cake or apple tart Irish sausages (small pieces or mini sausages) Mini shepherd’s pie cups Cheese and crackers (Irish cheddar if available) Green cupcakes or snacks to show Irish colors Thank you very much for your support and for helping make our World Heritage Day a special experience for the students. — Mr. Smith\n\nUpcoming Tests Math Topic 5 Tuesday, Nov 11th Grammar Workshop Unit 2 NOUNS (L9-14) Thursday, Nov 13th Social Studies World Heritage Day – Ireland Project Update 🇮🇪 Great job, everyone! You completed your Social Studies test today, so we didn’t have class time to plan your World Heritage Day project. However, some of you used your free time to keep working — well done! Please continue researching your topic at home and prepare simple, clear information to display on your board. Make sure your project includes both: Something to teach (1–2 minutes of information) Something to do (3–4 minutes of a fun, interactive activity for kids) Your booth should help visitors learn about Ireland while having fun. Be creative — you can add decorations around the classroom if you have time, such as flags, posters, shamrocks, or Irish symbols, to make your area stand out even more. Remember, World Heritage Day is on November 20th, so we only have two weeks left. Please come to class ready to share your ideas and continue preparing. Let’s make our Ireland project amazing! 🍀🇮🇪 There is not much homework in other subjects, so please make sure to think about World Heritage Day! Reading The story this week is 'Patterns in Nature. Please watch the video until you understand the story. https://www.youtube.com/watch?v=Aph1JPFkeXc The spelling test is TOMORROW! border certain clasp depart fierce journey observe superb treasure wisdom Extra reading ( I have added some new stories) TO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS Please go to ReadWorks and complete some of the stories assigned. They will help you with your work in school and also improve your overall reading. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Writing Homework – My Favorite Food 🍕🍰🍜 (MONDAY) We are learning about sequence — the order of steps in a process. For homework, you will write about how to make your favorite food and show the steps in sequence. 1) Choose your favorite food. 2) Write the steps in order using words like first, next, then, finally. 3) Draw a picture of your food under your writing. 4) Use a piece of tape to cover your drawing with another paper, making a flap. 5) On the front of the flap, draw a fun picture with a question mark (?) or write “Can you guess my food?” We will play a Guess the Food game on Monday, so please decorate your paper nicely — it will be displayed in the school! Be neat, colorful, and creative! Math (DUE MONDAY) Complete the red assessment pages! Remember, these pages are very similar to the test which is on TUESDAY! Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science NO Homework Korean (MONDAY) Pages 103-105 and 137-139 Also finish to page 45",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-11-06T10:33:43.992Z"
        }
      ]
    }
  ]
}