{
  "generatedAt": "2026-02-05T15:07:51.983Z",
  "day": "2025-09-24",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-09-24",
          "title": "MAP TESTING Great job on completing your first two MAP tests! I’ve noticed lots of growth in many students’ skills—we…",
          "details": "MAP TESTING Great job on completing your first two MAP tests! I’ve noticed lots of growth in many students’ skills—well done! The next test will be math tomorrow. To get ready,: 1) Review addition, subtraction, multiplication, and division facts. 2) Practice solving word problems step by step, and look for patterns and relationships in numbers. 3) Check your work carefully for mistakes, and use strategies like drawing a picture, making a table, or estimating to solve problems. 4) Stay calm, take your time, and read each question carefully. Only two more tests to go—keep up the great work! Reading The story this week is 'Living in Deserts'. Please watch the video until you understand the story. https://www.youtube.com/watch?v=NxDlziHeNdg The spelling words for next week are from Vocabulary Workshop Units 3 and 4. active bargain gasp loyal resource sensitive struggle value vary wander capture coward exclaim gloomy insist passage restless shallow shatter talent I have assigned a story on What Lives in the Deserts? (DUE FRIDAY) Please complete BEFORE NEXT FRIDAY! Please answer every question and SUBMIT. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math No book homework, but tomorrow is the math MAP test. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. THIS WILL HELP YOU WITH YOUR MATH MAP TEST Here are some MATH Blookets to help practice math. Grade 3 https://play.blooket.com/play?hwId=68d376702272f3ff6219032c Quadrilaterals https://play.blooket.com/play?hwId=68d3782e59b2c01cddc0157d Grade 5 https://play.blooket.com/play?hwId=68d378a4bf12180852bf44bc Korean Pages 115-119 and 20-33 in the Korean textbook and activity book. Chinese You need to write the words' student/boy/girl' twice before the next class.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-09-24T04:53:12.707Z"
        }
      ]
    }
  ]
}