{
  "generatedAt": "2026-02-05T15:07:51.987Z",
  "day": "2025-10-20",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-10-20",
          "title": "UpcomingTests Thursday, October 23rd -Math Topic 4 Friday, October 24th - Science Topic 2 Reading Complete this week'…",
          "details": "UpcomingTests Thursday, October 23rd -Math Topic 4 Friday, October 24th - Science Topic 2 Reading Complete this week's definition paper (Due Wednesday) Let’s Make Our Own Origin Myth! 🌏✨It was great to hear you reading your origin myth today in class! Tomorrow I will be displaying all the stories on the window for other students to read, so please color them and have them ready. The story this week is 'Why sun & moon live in the sky. It is a Myth. Please watch the video until you understand the story. https://www.youtube.com/watch?v=BSAknmmJv1M The spelling test for next Friday is: broadly foundation sturdy scales massive plenty dimmed invite enormous mud glittering squishy fur silvery spreads Complete all your AR reading quizzes for your library books! Extra reading Please go to ReadWorks and complete some of the stories assigned. They will help you with you work in school and also improve your overall reading. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math Complete Additional Practice 4-9 Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Complete the Assessment pages from the book. Pages 78-81 (Due Wednesday) Complete the Lesson Quiz on Magnetism (Due Wednesday) The science test is this Friday! Please play this game on Blooket to prepare for the test. https://play.blooket.com/play?hwId=68f5b39c217783b1957fb80c Social Studies Read and complete pages 62-63 in the Social Studies Book. (tomorrow)\n\nWe’re very lucky that Ms. Hanmi made a video for us to follow for our Christmas performance! Please take a look at it and practice at home with your family. If you have any questions or concerns, please let me know. Today, we’re just watching the video — don’t memorize it yet, just in case we make some changes later. Ms. Hanmi will put you in teams to practice in music class.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-10-20T12:49:41.995Z"
        }
      ]
    }
  ]
}