{
  "generatedAt": "2026-02-05T15:14:27.898Z",
  "day": "2025-10-29",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-10-29",
          "title": "Upcoming Tests Social Studies Chapter 2 - Tuesday, Nov 4th (Pages 45-82) Math - Topic 5 - Tuesday, Nov 11th Tomorrow …",
          "details": "Upcoming Tests Social Studies Chapter 2 - Tuesday, Nov 4th (Pages 45-82) Math - Topic 5 - Tuesday, Nov 11th Tomorrow is Bookaween! We will not have regular classes. Instead, we will do fun activities and have our presentation. You can wear a costume. It’s best if it matches the story, but it’s okay if it doesn’t, as long as it does not include blood, weapons, or anything that might scare anyone. There will be no more homework tomorrow, so enjoy the activities and the presentation! Reading The story this week is 'Patterns in Nature. Please watch the video until you understand the story. https://www.youtube.com/watch?v=Aph1JPFkeXc Bookaween (This is Tomorrow) Please memorize your part and practice reading it with power and expression. Tonight’s homework: Try your best to memorize your lines. Think of small actions you can do on stage to make your part more exciting. Practice reading slowly, clearly, and with expression. If memorizing is difficult, you may bring a small piece of paper to help you. When others are speaking, you can smile and make small movements, but do not make sounds or take attention away from the reader. Important: Tomorrow is our Bookaweek presentation. Be ready to perform on stage and show your best reading and actions. Playground Improvement Project – Homework (TOMORROW) Think about your local playground. What could be safer, cleaner, or more fun? Take notes, pictures, or make drawings. Write a letter to your apartment management or the mayor about a problem in your playground and explain what should change and why. Use your best handwriting or type your letter. Write your final letter on an A4 page, with the letter in the middle and pictures or drawings around it, or pictures at the top and the letter below. Bring your completed letter tomorrow. All letters will be displayed. Extra reading Please go to ReadWorks and complete some of the stories assigned. They will help you with your work in school and also improve your overall reading. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it Math Complete Additional Practice 5-4 (MONDAY) Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Great work, everyone! We all have a water cycle display on the window to watch and learn from. There is no other homework. Just watch the videos about the water cycle. https://www.youtube.com/watch?v=ncORPosDrjI https://www.youtube.com/watch?v=gBbFxl6Oy94 https://www.youtube.com/watch?v=TD3XSIE4ymo https://www.youtube.com/watch?v=Oq8iCsV4woE Social Studies Read and complete pages 79-82 (MONDAY) Please keep thinking of ideas for your World Heritage Day project! Korean Page 80-81 and 120-131 (MONDAY)",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-10-29T06:13:58.064Z"
        }
      ]
    }
  ]
}