{
  "generatedAt": "2026-02-05T15:07:51.993Z",
  "day": "2025-11-18",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2025-11-18",
          "title": "Upcoming Tests Science - Topic 3 - Weather - November 26th Math - Topic 6 - Area - November 26th World Heritage Day –…",
          "details": "Upcoming Tests Science - Topic 3 - Weather - November 26th Math - Topic 6 - Area - November 26th World Heritage Day – Ireland Project (THIS THURSDAY) Tomorrow, I need to review what each person has completed, so please come ready to show your work. Reminder: Some students have not been utilizing their preparation time effectively and have relied too heavily on others to complete the work. Please think carefully about your board layout before tomorrow so you can use class time efficiently. A grade will be given based on the work you contribute to the board and your interaction with the students who visit your booth. Tomorrow is your last chance to add to or improve your work on the display. I will grade the final boards on Wednesday evening. Now it’s time to finish all the work with your group. Your booth must include: A short 1-minute teaching part A 3–4 minute hands-on activity Green, white, and orange decorations Fair teamwork Everyone wearing green Tonight: Prepare what you will say at your booth. Each group should memorize 1–2 sentences to introduce your project. When visitors arrive, say “Dia dhuit.” When they leave, say “Slán.” Group introductions: Language Group: “Dia dhuit. We are the Language Group. We will teach you some Irish words.” Legends and Myths Group: “Dia dhuit. We are the Legends and Myths Group. We will share a short Irish legend.” Music and Dance Team: “Dia dhuit. We are the Music and Dance Team. We will teach you a fun rhythm or movement.” Symbols and Landmarks Team: “Dia dhuit. We are the Symbols and Landmarks Team. We will teach you about important Irish places.” Short facts + hands-on fun = the best booth. Work together so everyone knows their job. Korean Complete pages 190-202 Reading AR reading Quizzes by Tomorrow! Complete up to page 334 in the My View Reading Book Complete the definition paper before WEDNESDAY The story this week is 'Wolf Island.\" https://www.youtube.com/watch?v=N6LsBdRnboI&t=10s The spelling test next Friday is depended well-being population available balance meadows pups curious sniffed howled mainland scrambled mild gnawed returned Extra reading ( I have added some new stories) TO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS Please go to ReadWorks and complete some of the stories assigned. They will assist you with your schoolwork and also enhance your overall reading skills. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it. Math Complete Additional Practice 6-5 I have added New Khan Academy related to area. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Complete the lesson quiz related to hazardous weather. Language Arts Vocabulary Workshop - 72-73 Grammar Workshop - 78-79",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2025-11-18T07:02:00.590Z"
        }
      ]
    }
  ]
}