{
  "generatedAt": "2026-02-05T15:34:33.626Z",
  "day": "2026-01-09",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-01-09",
          "title": "Reading\n\nPlease catch up with ReadWorks this weekend. Also, read and take AR quizzes for any books you have at home!\n…",
          "details": "Reading\n\nPlease catch up with ReadWorks this weekend. Also, read and take AR quizzes for any books you have at home!\n\nTO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS\n\nPlease go to ReadWorks and complete some of the stories assigned. They will assist you with your schoolwork and also enhance your overall reading skills.\n\nGo to www.readworks.org/student \n\nEnter our class code YU6GQ2\nYour password is 1234 unless you already changed it.\n\nMath\n\nComplete Additional Practice 8-3 student book and homework book.\n\nI have added New Khan Academy lessons related to data.\n\nPlease have your child practice a little Khan Academy math each night\n at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills.\n\nSocial Studies (DUE MONDAY)\n\nRead and complete 142-145 in the social studies textbook and complete the worksheet. \n\nLanguage Arts\n\nComplete pages 94-95 in the vocabulary workshop book.\n\nWe will have a class talent show in our next Language Arts class. This talent show connects with the story about a talent show in our vocabulary book.\n\nPlease think about a talent you would like to share with the class. This could be a song, a dance, a joke, magic, or anything else you can do.\n\nYou may perform your talent live in class, or you can record a short video and send it to me.\n\nOn Tuesday, we will watch and enjoy each other’s talents together.\n\nHave fun, be confident, and enjoy sharing your talent with the class!\n\nPlease complete one more journal.\nYou may write about your first week back at school, your trip to Job World, or the leadership camp.\n\nChoose one topic and do your best writing.\n\nKorean (DUE MONDAY)\n\n230-246\n251-253",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-01-09T05:09:52.676Z"
        }
      ]
    }
  ]
}