{
  "generatedAt": "2026-02-05T15:34:33.627Z",
  "day": "2026-01-16",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-01-16",
          "title": "Upcoming Tests\n\nTuesday January 20th - Vocabulary Workshop Unit 1-9\nTuesday Januart 20th - Grammar Worshop - Unit 3 (…",
          "details": "Upcoming Tests\n\nTuesday January 20th - Vocabulary Workshop Unit 1-9\nTuesday Januart 20th - Grammar Worshop - Unit 3 (Verbs)\nWednesday January - 21st - Math Topic 8\n\nReading\n\nPlease watch the video of this weeks story.\n\nhttps://www.youtube.com/watch?v=c1ltLnSAaT4\n\nPrepare for the spelling test next Friday\n\nabandon\nappeared\nenormous\nInterfered\nstationary\nharbor\nvoyage\nboarded\ncabin\ncramped\nbunks\ndecks\nstewards\nunsinkable \nmaze\nsobbing\nterrified\ncreaking\nlifeboats\npassengers\n\nPlease make sure students log in to ReadWorks and complete the assigned stories. New passages have been added, including one on the Titanic and another on the three branches of government, which link closely to our class learning.\nStudents should also read their library books and complete the AR quizzes once finished.\n\nReadWorks login:\n\nwww.readworks.org/student\n\nClass code: YU6GQ2\n\nPassword: [REDACTED] (unless already changed)\n\nMath\n\nComplete Additional Practice 8-7 student book and homework book.\n\nI have added New Khan Academy lessons related to data.\n\nPlease have your child practice a little Khan Academy math each night\n at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills.\n\nLanguage Arts\n\nComplete pages 114-117 in the Grammar Workshop Book.\n\n1 more journal\n\nJournal tips\n\nMake sure your journal has a clear beginning, middle, and ending. Write in full sentences and use the past tense. Add details about what you did, how you felt, and what you learned. Use time words like first, then, after that, and finally to help organize your ideas. Remember to check your spelling, punctuation, and capital letters before you finish.\n\nSample journal\n\nLast weekend was busy and exciting. On Saturday, I went to the dentist with my daughter. I felt very nervous at first, but I tried to be brave. The dentist visit went well, and I felt relieved afterward. After that, my daughter and I ate some delicious food together. Then we took a walk along Cheonggyecheon Stream in Seoul and enjoyed looking at the water and walking together.\nOn Sunday, my wife went out, so I stayed home with my three kids. It was cold outside, so we stayed indoors and played board games and pool. We also played Blooket, and everyone laughed a lot. I had so much fun spending time with my kids.\n\nIn the end, I had a great weekend. Even though I was nervous at first, I felt happy and proud. Spending time with my family made the weekend special.\n\nScience\n\nRead and complete pages 152-155 of the science textbook.\n\nSocial Studies\nRead and complete pages 158-165\n\nComplete the Readworks story about branches of government.\n\nWatch the videos about levels of government\nhttps://www.youtube.com/watch?v=_sQNz2liUuY \nhttps://www.youtube.com/watch?v=RwQ2U2iKswU\n\nKorean \n268-274",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-01-16T06:34:28.969Z"
        }
      ]
    }
  ]
}