{
  "generatedAt": "2026-02-05T15:07:52.003Z",
  "day": "2026-01-28",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-01-28",
          "title": "Upcoming Tests Monday February 2nd - Chapter 4 test - Government, Landmarks and Symbols Reading Complete pages 83-87 …",
          "details": "Upcoming Tests Monday February 2nd - Chapter 4 test - Government, Landmarks and Symbols Reading Complete pages 83-87 Read and complete the AR quizzes for your library book! Tomorrow at library time I will be checking the main character, setting and plot for your literary fair project. Please watch the video of this weeks story. https://www.youtube.com/watch?v=rGX67yYNsJk Prepare for the spelling test next Friday remember patience figured temper complain mayor evacuate brave hurricanes sandbags attic hatchet thunder drizzle flooded swallowing signal levees whooped interstate I will be giving grades for the readworks participation. Please log in and complete the reading passages. Please make sure students log in to ReadWorks and complete the assigned stories. New passages have been added that link closely to our class learning. ReadWorks login: www.readworks.org/student Class code: YU6GQ2 Password: 1234 (unless already changed) Literary Fair I have checked the plots for five students. I still need to check the remaining four so we can keep working on the boards. Please continue completing your board. Finish the artwork and glue it onto the board, along with the main characters and the setting. Keep working on bringing your board to life. Math Complete Additional Practice 9-4 student book and homework book. I have added new Khan Academy lessons related to data. Please try to have your child practise a little Khan Academy maths each night using https://www.khanacademy.org/join/VK6QDS9E as this will help strengthen their overall maths skills. I have noticed that some students are not logging in or completing any work yet. It is important that they try to log in regularly and complete some activities so they can continue to improve their maths. Social Studies Prepare for the test 1) Look over the book pages 138-180 2) Try the blooket with similar questions to the test. https://play.blooket.com/play?hwId=6979876b001f0082f3a6ce93 Language Arts Grammar workshop 122-123 (Thursday) Chinese Complete the worksheet given in class today! Login and practice on the Chinese website. Korean 42-47",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-01-28T04:04:28.932Z"
        }
      ]
    }
  ]
}