{
  "generatedAt": "2026-02-05T15:34:33.628Z",
  "day": "2026-02-05",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-02-05",
          "title": "Not much extra homework today!\n\nThere is not much homework today, so this is a good chance to go back and check if yo…",
          "details": "Not much extra homework today!\n\nThere is not much homework today, so this is a good chance to go back and check if you have missed any homework.\n\nIf you have any missing homework, please bring it to school tomorrow so your grade can be updated. Remember, it is your responsibility to complete and submit any missing work.\n\nPlease take time and care when doing your homework. If the writing is hard to read or it looks like little time was spent on it, it may not receive the best grade.\n\nHomework is a chance to review what we learned in class, so try your best and check your work before coming to school.\n\nLiterary Fair Update\n\nWe have now added all of the required Literary Fair information to the boards in class. This includes the main character, the setting, the plot, the conflict, the solution, the theme, the reason you liked the book, and the key words.\n\nTomorrow, the boards will be sent home. Over the weekend, you will decorate your board and make it creative and interesting. Please take good care of it while it is at home.\n\nTonight, start thinking of creative ideas for how you want your board to look so you are ready to work on it over the weekend.\n\nAll completed boards must be brought back to school on Monday so we can continue with the next steps of the project.\n\nReading\nComplete the definion paper with 3 example sentences.\n\nRead and complete the AR quizzes for your library book!\n\nPlease watch the video of this weeks story.\n\nhttps://www.youtube.com/watch?v=KBOtCcC-MAg\n\nPrepare for the spelling test next Friday\n\nwit\nconquer\nbrink\nintend\nfury\nchill\npatterns\nactual\nvibrant\nfortunate\n\nI will be giving grades for the readworks participation. Please log in and complete the reading passages.\n\nPlease make sure students log in to ReadWorks and complete the assigned stories. New passages have been added that link closely to our class learning.  \n\nReadWorks login:\n\nwww.readworks.org/student\n\nClass code: YU6GQ2\n\nPassword: [REDACTED] (unless already changed)\n\nMath\n\nI have added new Khan Academy lessons related to data.\n\nPlease try to have your child practise a little Khan Academy maths each night using\n\nhttps://www.khanacademy.org/join/VK6QDS9E\n\nas this will help strengthen their overall maths skills.\n\nI have noticed that some students are not logging in or completing any work yet.\n\nIt is important that they try to log in regularly and complete some activities so they can continue to improve their maths.\n\nScience\n\nRead and complete pages 174-177 by Friday\n\nSocial Studies\n\nComplete pages 186-191 by Monday\n\nChinese \nComplete the worksheet given in class today! Login and practice on the Chinese website.\n\nKorean\n38-41 \n\n10-21",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-02-05T07:20:28.279Z"
        }
      ]
    }
  ]
}