{
  "generatedAt": "2026-02-05T15:14:27.905Z",
  "day": "2026-01-23",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-01-23",
          "title": "Upcoming Tests Wednesday January 28th Topic 4 Test Climate Monday February 2nd Chapter 4 test Government, Landmarks a…",
          "details": "Upcoming Tests Wednesday January 28th Topic 4 Test Climate Monday February 2nd Chapter 4 test Government, Landmarks and Symbols Reading Complete up to page 16 in the My View Workbook. Read and complete the AR quizzes for your library book! Complete the plot part for your literary fair book on the paper I gave you or your own paper of the same size. (Monday). Please write this on some note paper for the teacher to check. Please watch the video of this weeks story. https://www.youtube.com/watch?v=rGX67yYNsJk Prepare for the spelling test next Friday remember patience figured temper complain mayor evacuate brave hurricanes sandbags attic hatchet thunder drizzle flooded swallowing signal levees whooped interstate I will be giving grades for the readworks participation. Please log in and complete the reading passages. Please make sure students log in to ReadWorks and complete the assigned stories. New passages have been added, including one on the Titanic and another on the three branches of government, which link closely to our class learning. Students should also read their library books and complete the AR quizzes once finished. ReadWorks login: www.readworks.org/student Class code: YU6GQ2 Password: [REDACTED] (unless already changed) Math Complete Additional Practice 9-1 student book and homework book. I have added New Khan Academy lessons related to data. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Science Complete the lesson quiz World Climates. This blooket will help you prepare for the test https://play.blooket.com/play?hwId=6970529c7a98935214a111a5 Social Studies Watch and Learn https://www.youtube.com/watch?v=eIO-7dFz2JU Documents https://www.youtube.com/watch?v=t4ED9ytXPm4 Landmarks https://www.youtube.com/watch?v=CJLGw0lkcdE Symbols Language Arts Complete 1 more journal",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-01-23T07:00:38.252Z"
        }
      ]
    }
  ]
}