{
  "generatedAt": "2026-02-05T15:14:27.904Z",
  "day": "2026-01-08",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-01-08",
          "title": "Reading The relationships in nature poster is due tomorrow. Please decorate it and bring it to school. The spelling t…",
          "details": "Reading The relationships in nature poster is due tomorrow. Please decorate it and bring it to school. The spelling test is tomorrow Please prepare the following words. ancient climate cling custom decay disturb expose perform remote timid ability avoid bashful brief compete consider delightful honor reflex remark Extra reading TO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS Please go to ReadWorks and complete some of the stories assigned. They will assist you with your schoolwork and also enhance your overall reading skills. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it. Math Complete Additional Practice 8-2 student book and homework book. I have added New Khan Academy lessons related to data. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Social Studies (DUE MONDAY) Read and complete 142-145 in the social studies textbook and complete the worksheet. Language Arts Complete pages 106-107 in the grammar workshop book. Job World Homework (Due tomorrow) Please complete the future job worksheets. Science Jiwoo will be doing a science experiment tomorrow in the science room. Please have students bring one shoelace or a piece of string and one paper plate. If you do not have these items, do not worry — students can share them. If you have a few extra items at home, please feel free to bring them along. Thank you.\n\nGreat job to the students who won prizes for Best Winter Reader. I’m so proud of how hard all my students read. Even if you didn’t get a prize, I know how much effort you put into reading every week. Also, great job to Jiwoo with the Your Idol performance. You did a great job and should be very proud of yourself.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-01-08T07:58:50.128Z"
        }
      ]
    }
  ]
}