{
  "generatedAt": "2026-02-05T15:07:52.003Z",
  "day": "2026-01-26",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-01-26",
          "title": "Upcoming Tests Wednesday Wednesday January 28th - Topic 4 Test - Climate Monday February 2nd - Chapter 4 test - Gover…",
          "details": "Upcoming Tests Wednesday Wednesday January 28th - Topic 4 Test - Climate Monday February 2nd - Chapter 4 test - Government, Landmarks and Symbols Reading Complete the defintion paper (WEDNESDAY) Read and complete the AR quizzes for your library book! Tomorrow at library time I will be checking the main character, setting and plot for your literary fair project. Please watch the video of this weeks story. https://www.youtube.com/watch?v=rGX67yYNsJk Prepare for the spelling test next Friday remember patience figured temper complain mayor evacuate brave hurricanes sandbags attic hatchet thunder drizzle flooded swallowing signal levees whooped interstate I will be giving grades for the readworks participation. Please log in and complete the reading passages. Please make sure students log in to ReadWorks and complete the assigned stories. New passages have been added, including one on the Titanic and another on the three branches of government, which link closely to our class learning. Students should also read their library books and complete the AR quizzes once finished. ReadWorks login: www.readworks.org/student Class code: YU6GQ2 Password: 1234 (unless already changed) Math Complete Additional Practice 9-2 student book and homework book. I have added New Khan Academy lessons related to data. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Prepare for the topic 4 test Climate Pages 126-165 This blooket will also help you prepare for the test https://play.blooket.com/play?hwId=6970529c7a98935214a111a5 Korean 42-47",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-01-26T06:50:13.555Z"
        }
      ]
    }
  ]
}