{
  "generatedAt": "2026-02-05T15:14:27.906Z",
  "day": "2026-02-03",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-02-03",
          "title": "Upcoming Tests Math - Thursday February 5th - Topic 9 test Reading Complete the definion paper with 3 example sentenc…",
          "details": "Upcoming Tests Math - Thursday February 5th - Topic 9 test Reading Complete the definion paper with 3 example sentences. Read and complete the AR quizzes for your library book! Please watch the video of this weeks story. https://www.youtube.com/watch?v=KBOtCcC-MAg Prepare for the spelling test next Friday wit conquer brink intend fury chill patterns actual vibrant fortunate I will be giving grades for the readworks participation. Please log in and complete the reading passages. Please make sure students log in to ReadWorks and complete the assigned stories. New passages have been added that link closely to our class learning. ReadWorks login: www.readworks.org/student Class code: YU6GQ2 Password: [REDACTED] (unless already changed) Math Complete the red assessment pages by tomorrow. I have added new Khan Academy lessons related to data. Please try to have your child practise a little Khan Academy maths each night using https://www.khanacademy.org/join/VK6QDS9E as this will help strengthen their overall maths skills. I have noticed that some students are not logging in or completing any work yet. It is important that they try to log in regularly and complete some activities so they can continue to improve their maths. Social Studies We have started a small project that connects to our chapter on being a good citizen. Students need to write down good deeds they do. These can be small or big actions that show kindness, responsibility, or helping others. Before Lunar New Year Break, students should complete the first side of the paper. I will check this before the break. During the Lunar New Year holiday, students should continue writing good deeds on the back of the paper. These should be real actions they did during the break. This project will be checked and graded on February 12th and again on February 26th. Science Please complete the Venn diagram on your worksheet. Compare two different life cycles. Choose two organisms for each side of the diagram. Use the middle section to show what the life cycles have in common. I will check this on Wednesday. Make sure your work is neat and complete. Language Arts Grammar Workshop - Pages 130-131 Chinese Complete the worksheet given in class today! Login and practice on the Chinese website. Korean 38-41 10-21 Spanish Write the numbers in Spanish and their favorite thing.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-02-03T05:14:03.109Z"
        }
      ]
    }
  ]
}