{
  "generatedAt": "2026-02-05T15:07:52.005Z",
  "day": "2026-02-04",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-02-04",
          "title": "Upcoming Tests Math - Thursday February 5th - Topic 9 test Literary Fair (HAVE ALL ELEMENTS READY TO PUT ON THE BOARD…",
          "details": "Upcoming Tests Math - Thursday February 5th - Topic 9 test Literary Fair (HAVE ALL ELEMENTS READY TO PUT ON THE BOARD TOMORROW) I have now covered all the required elements of the Literary Fair in class. The main character, the setting, the plot, the conflict, the solution, the theme, the reason you liked the book, and the key words should all be completed. All of this work was done in class today, and you were given the paper to write your information on so it can be added to your board. We need to add all of this information to the board tomorrow. Everything should be neatly written so people can easily read it when they come to our classroom. From now on, we will move on to decorating the board, creating a quiz, and practicing how to present your project to people who come to our class. Please make sure your written work is ready so we can focus on these next steps. Reading Complete the definion paper with 3 example sentences. Read and complete the AR quizzes for your library book! Please watch the video of this weeks story. https://www.youtube.com/watch?v=KBOtCcC-MAg Prepare for the spelling test next Friday wit conquer brink intend fury chill patterns actual vibrant fortunate I will be giving grades for the readworks participation. Please log in and complete the reading passages. Please make sure students log in to ReadWorks and complete the assigned stories. New passages have been added that link closely to our class learning. ReadWorks login: www.readworks.org/student Class code: YU6GQ2 Password: 1234 (unless already changed) Math Tomorrow is the MATH TEST! Please read over all the pages we covered today to prepare for the test! I have added new Khan Academy lessons related to data. Please try to have your child practise a little Khan Academy maths each night using https://www.khanacademy.org/join/VK6QDS9E as this will help strengthen their overall maths skills. I have noticed that some students are not logging in or completing any work yet. It is important that they try to log in regularly and complete some activities so they can continue to improve their maths. Science Read and complete pages 174-177 by Friday Social Studies Complete pages 186-191 by Monday Chinese Complete the worksheet given in class today! Login and practice on the Chinese website. Korean 38-41 10-21 Spanish Write the numbers in Spanish and their favorite thing.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-02-04T06:45:57.528Z"
        }
      ]
    }
  ]
}