{
  "generatedAt": "2026-02-05T15:14:27.905Z",
  "day": "2026-01-21",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-01-21",
          "title": "Upcoming Tests Thursday January 22nd - Math Topic 8 Friday January 23rd - Vocabulary Workshop Unit 1-9 Reading Comple…",
          "details": "Upcoming Tests Thursday January 22nd - Math Topic 8 Friday January 23rd - Vocabulary Workshop Unit 1-9 Reading Complete 46-49 in the my view book. Complete the definition paper (WEDNESDAY) Please watch the video of this weeks story. https://www.youtube.com/watch?v=c1ltLnSAaT4 Prepare for the spelling test next Friday abandon appeared enormous Interfered stationary harbor voyage boarded cabin cramped bunks decks stewards unsinkable maze sobbing terrified creaking lifeboats passengers Please make sure students log in to ReadWorks and complete the assigned stories. New passages have been added, including one on the Titanic and another on the three branches of government, which link closely to our class learning. Students should also read their library books and complete the AR quizzes once finished. ReadWorks login: www.readworks.org/student Class code: YU6GQ2 Password: [REDACTED] (unless already changed) Math Complete the Retaching and Red assessment pages from the math text book. These pages will help you with the test on Thursday. I have added New Khan Academy lessons related to data. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Language Arts (DUE TUESDAY) Complete pages 118-119 in the Grammar Workshop Book. Social Studies Complete the Readworks story about branches of government. Watch the videos about symbols and landmarks of USA https://www.youtube.com/watch?v=CJLGw0lkcdE https://www.youtube.com/watch?v=t4ED9ytXPm4 Literary Fair Poster Project Check the attached template and examples You have been given a presentation board. This board will be used to show your understanding of your book in a clear, creative, and visual way. Your work must be neat, colourful, well organised, and easy to read. Middle of the Board (Center Section) The centre of the board must include the picture you drew in art class. This picture should clearly relate to your book and show an important scene, character, or idea. Under the picture, you must include the following information clearly written or typed: Book title Author Publisher Date the book was published Make sure this information is centred and easy to read. Left Side of the Board The left side of the board must include the following sections: Main characters (include pictures and names) Setting (where and when the story takes place, include pictures) Plot (a short summary of what happens in the story) Each section should be clearly labelled with a heading. You may type your answers, but the font size must be large enough to read from a distance. Right Side of the Board The right side of the board must include: The problem The solution Author’s purpose (why did the author write this book) Why I liked the book Five key words from the book with short explanations Each section must be labelled and neatly organised. Typed work is allowed, but handwriting is also fine if it is neat and clear. Theme and Design Your poster must have a clear theme that matches your book and runs through the entire board. For example, if your book is Harry Potter, you could decorate the board with small wands, stars, or magical symbols to separate sections. If your book is about sports, animals, mystery, or adventure, your decorations should match that idea. Use colours, borders, shapes, and images to make your board eye catching and professional. Pictures and Graphics You must include pictures for the main characters and the setting. These can be printed or neatly drawn. Your board should be highly visual, not just text. Your goal is to make your board graphic, creative, informative, and high quality.\n\nUpcoming Tests Thursday January 22nd - Math Topic 8 Friday January 23rd - Vocabulary Workshop Unit 1-9 Reading Complete 52-55 in the my view book. (Tomorrow) Complete the Settting and Main Character part for your literary fair book on the paper I gave you or your own paper of the same size. (Friday) Please watch the video of this weeks story. https://www.youtube.com/watch?v=c1ltLnSAaT4 Prepare for the spelling test next Friday abandon appeared enormous Interfered stationary harbor voyage boarded cabin cramped bunks decks stewards unsinkable maze sobbing terrified creaking lifeboats passengers Please make sure students log in to ReadWorks and complete the assigned stories. New passages have been added, including one on the Titanic and another on the three branches of government, which link closely to our class learning. Students should also read their library books and complete the AR quizzes once finished. ReadWorks login: www.readworks.org/student Class code: YU6GQ2 Password: [REDACTED] (unless already changed) Math Tomorrow is the math test! Please look over the red pages so you are ready for the test. Science Read and complete 152-159 This blooket will help you prepare for the test https://play.blooket.com/play?hwId=6970529c7a98935214a111a5 Social Studies Read and complete pages 168-173 in the Social Studies Text book. Chinese Complete the writing worksheet. Korean 276-278 Bring your new book to the next class.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-01-21T05:52:14.602Z"
        }
      ]
    }
  ]
}