{
  "generatedAt": "2026-02-05T15:34:33.627Z",
  "day": "2026-01-30",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-01-30",
          "title": "Upcoming Tests\n\nMonday  February 2nd - Chapter 4 test - Government, Landmarks and Symbols\nThursday February 5th - Top…",
          "details": "Upcoming Tests\n\nMonday  February 2nd - Chapter 4 test - Government, Landmarks and Symbols\nThursday February 5th - Topic 9 test \nReading\n\nComplete all pages of the workbook up until 26.\n\nRead and complete the AR quizzes for your library book!\n\nPlease watch the video of this weeks story.\n\nhttps://www.youtube.com/watch?v=KBOtCcC-MAg\n\nPrepare for the spelling test next Friday\n\nwit\nconquer\nbrink\nintend\nfury\nchill\npatterns\nactual\nvibrant\nfortunate\n\nI will be giving grades for the readworks participation. Please log in and complete the reading passages.\n\nPlease make sure students log in to ReadWorks and complete the assigned stories. New passages have been added that link closely to our class learning.  \n\nReadWorks login:\n\nwww.readworks.org/student\n\nClass code: YU6GQ2\n\nPassword: [REDACTED] (unless already changed)\n\nMath\n\nComplete Additional Practice 9-5 student book and homework book.\n\nI have added new Khan Academy lessons related to data.\n\nPlease try to have your child practise a little Khan Academy maths each night using\n\nhttps://www.khanacademy.org/join/VK6QDS9E\n\nas this will help strengthen their overall maths skills.\n\nI have noticed that some students are not logging in or completing any work yet.\n\nIt is important that they try to log in regularly and complete some activities so they can continue to improve their maths.\n\nSocial Studies\n\nPrepare for the test on MONDAY!\n\n1) Look over the book pages 138-180\n\n2) Try the blooket with similar questions to the test.\n\nhttps://play.blooket.com/play?hwId=6979876b001f0082f3a6ce93\n\nLanguage Arts\n\nGrammar Workshop - Pages 124-125\n\n1 More journal\n\nJournal Writing Reminder\n\nSome students are making the same mistakes each week, so please read this carefully before writing your next journal.\n\nMake sure you write in the past tense. Journals are about things that already happened.\n\nYour journal needs a clear beginning, middle, and ending. Think about what happened first, next, and last.\n\nWrite slowly and clearly so your writing is neat and easy to read.\n\nTry to make your journal more exciting for the reader. Use sensory words to describe what you saw, heard, smelled, tasted, or felt. Add details, describing words, humor, and creativity to bring your story to life.\n\nBelow is an example journal you can use as a model.\n\nLast weekend was very busy and fun. On Saturday morning, I went to the dentist. The chair was uncomfortable, and I could hear strange buzzing sounds, which made me a little nervous. After that, I felt relieved it was finished.\n\nLater that day, I took my son to a bookstore in Seoul. The store was bright and quiet, and it smelled like new books. We walked around the shelves, flipping through colorful covers and talking about which books looked interesting.\n\nOn Sunday, we went to a local kids café called Jumping Monster. It was loud, energetic, and full of laughter. Even though I am the father, I like to play too. I played Nintendo badminton, a fast car racing game, and even sang in the singing room. By the end of the day, I was tired but happy, and it was a weekend I really enjoyed.\n\nScience\n\nLifecyles\n\nWatch the videos to gain understanding of the next topic!\n\nFrogs\nhttps://www.youtube.com/watch?v=F3ElGMVU6SY\nHumans\nhttps://www.youtube.com/watch?v=2vUPhZUofco\nButterflies\nhttps://www.youtube.com/watch?v=3kZD6rlSLUw\n\nChinese \nComplete the worksheet given in class today! Login and practice on the Chinese website.\n\nKorean\n42-47\n\nSpanish\nWrite the numbers in Spanish and their favorite thing.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-01-30T05:04:34.038Z"
        }
      ]
    }
  ]
}