{
  "generatedAt": "2026-02-05T15:07:51.999Z",
  "day": "2026-01-12",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-01-12",
          "title": "Reading Please catch up with ReadWorks! Also, read and take AR quizzes for any books you have at home! TO IMPROVE REA…",
          "details": "Reading Please catch up with ReadWorks! Also, read and take AR quizzes for any books you have at home! TO IMPROVE READING AND EMBED LEARNING, YOU SHOULD BE LOGGING INTO READWORKS Please go to ReadWorks and complete some of the stories assigned. They will assist you with your schoolwork and also enhance your overall reading skills. Go to www.readworks.org/student Enter our class code YU6GQ2 Your password is 1234 unless you already changed it. Math Complete Additional Practice 8-4 student book and homework book. I have added New Khan Academy lessons related to data. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Read and complete pages 142-147 Complete the climate change worksheet. Watch the videos about climate change to embed knowledge https://www.youtube.com/watch?v=WkvPdUtYhX8 https://www.youtube.com/watch?v=tykLKCT7DyY Social Studies Read and complete pages 142-149 Watch the videos about the 3 branches of government to embed knowledge https://www.youtube.com/watch?v=OvwlRTYvU8o https://www.youtube.com/watch?v=PRVX8Qn88MQ&list=RDPRVX8Qn88MQ&start_radio=1 Korean 268-274 Language Arts 3-1 talent show! Language Arts Complete pages 94-95 in the vocabulary workshop book. We will have a class talent show in our next Language Arts class. This talent show connects with the story about a talent show in our vocabulary book. Please think about a talent you would like to share with the class. This could be a song, a dance, a joke, magic, or anything else you can do. You may perform your talent live in class, or you can record a short video and send it to me. On Tuesday, we will watch and enjoy each other’s talents together. Have fun, be confident, and enjoy sharing your talent with the class!",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-01-12T07:02:19.905Z"
        }
      ]
    }
  ]
}