{
  "generatedAt": "2026-02-05T15:07:52.001Z",
  "day": "2026-01-19",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-01-19",
          "title": "Upcoming Tests Tuesday Januart 20th - Grammar Worshop - Unit 3 (Verbs) Thursday January 22nd - Math Topic 8 Friday Ja…",
          "details": "Upcoming Tests Tuesday Januart 20th - Grammar Worshop - Unit 3 (Verbs) Thursday January 22nd - Math Topic 8 Friday January 23rd - Vocabulary Workshop Unit 1-9 Reading Complete 44-45 in the my view book. Complete the definition paper (WEDNESDAY) Please watch the video of this weeks story. https://www.youtube.com/watch?v=c1ltLnSAaT4 Prepare for the spelling test next Friday abandon appeared enormous Interfered stationary harbor voyage boarded cabin cramped bunks decks stewards unsinkable maze sobbing terrified creaking lifeboats passengers Please make sure students log in to ReadWorks and complete the assigned stories. New passages have been added, including one on the Titanic and another on the three branches of government, which link closely to our class learning. Students should also read their library books and complete the AR quizzes once finished. ReadWorks login: www.readworks.org/student Class code: YU6GQ2 Password: 1234 (unless already changed) Math Complete Additional Practice 8-8 student book and homework book. I have added New Khan Academy lessons related to data. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Language Arts (DUE TUESDAY) Complete pages 114-117 in the Grammar Workshop Book. Social Studies Complete the cut and paste worksheet for levels of government Read and complete pages Complete the Readworks story about branches of government. Watch the videos about symbols and landmarks of USA https://www.youtube.com/watch?v=CJLGw0lkcdE https://www.youtube.com/watch?v=t4ED9ytXPm4 Science Watch the video about climate zones https://www.youtube.com/watch?v=5tC8OOxOFEk https://www.youtube.com/watch?v=Kp7ZhvJXrMc Korean 276-278",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-01-19T06:48:19.941Z"
        }
      ]
    }
  ]
}