{
  "generatedAt": "2026-02-05T15:34:33.628Z",
  "day": "2026-02-04",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-02-04",
          "title": "Upcoming Tests\nMath - Thursday February 5th - Topic 9 test\nLiterary Fair (HAVE ALL ELEMENTS READY TO PUT ON THE BOARD…",
          "details": "Upcoming Tests\nMath - Thursday February 5th - Topic 9 test\nLiterary Fair (HAVE ALL ELEMENTS READY TO PUT ON THE BOARD TOMORROW)\nI have now covered all the required elements of the Literary Fair in class. The main character, the setting, the plot, the conflict, the solution, the theme, the reason you liked the book, and the key words should all be completed. \n\nAll of this work was done in class today, and you were given the paper to write your information on so it can be added to your board.\n\nWe need to add all of this information to the board tomorrow. Everything should be neatly written so people can easily read it when they come to our classroom.\n\nFrom now on, we will move on to decorating the board, creating a quiz, and practicing how to present your project to people who come to our class.\n\nPlease make sure your written work is ready so we can focus on these next steps.\n\nReading\nComplete the definion paper with 3 example sentences.\n\nRead and complete the AR quizzes for your library book!\n\nPlease watch the video of this weeks story.\n\nhttps://www.youtube.com/watch?v=KBOtCcC-MAg\n\nPrepare for the spelling test next Friday\n\nwit\nconquer\nbrink\nintend\nfury\nchill\npatterns\nactual\nvibrant\nfortunate\n\nI will be giving grades for the readworks participation. Please log in and complete the reading passages.\n\nPlease make sure students log in to ReadWorks and complete the assigned stories. New passages have been added that link closely to our class learning.  \n\nReadWorks login:\n\nwww.readworks.org/student\n\nClass code: YU6GQ2\n\nPassword: [REDACTED] (unless already changed)\n\nMath\n\nTomorrow is the MATH TEST! Please read over all the pages we covered today to prepare for the test!\n\nI have added new Khan Academy lessons related to data.\n\nPlease try to have your child practise a little Khan Academy maths each night using\n\nhttps://www.khanacademy.org/join/VK6QDS9E\n\nas this will help strengthen their overall maths skills.\n\nI have noticed that some students are not logging in or completing any work yet.\n\nIt is important that they try to log in regularly and complete some activities so they can continue to improve their maths.\n\nScience\n\nRead and complete pages 174-177 by Friday\n\nSocial Studies\n\nComplete pages 186-191 by Monday\n\nChinese \nComplete the worksheet given in class today! Login and practice on the Chinese website.\n\nKorean\n38-41 \n\n10-21\n\nSpanish\nWrite the numbers in Spanish and their favorite thing.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-02-04T06:45:57.528Z"
        }
      ]
    }
  ]
}