{
  "generatedAt": "2026-02-05T15:07:52.000Z",
  "day": "2026-01-15",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-01-15",
          "title": "There was no new homework added today. We spent the day having fun and using this time to wish Jey and Jiwoo good luc…",
          "details": "There was no new homework added today. We spent the day having fun and using this time to wish Jey and Jiwoo good luck. Tomorrow, students will only need to complete the homework that was given on previous days. I will also be expecting more regular logins and activity on ReadWorks and Khan Academy. As a reminder, tomorrow is golf in athletics, so if you have golf gloves, please bring them to school. IMPORTANT CHOOSE SEMESTER 2 CLUBS (BEFORE TOMORROW) Please use the link below to choose your clubs. https://forms.gle/MyczdXU2gT4Q891w6 First, make sure you select the correct class. Please write your full name clearly so we know who you are. You must choose your top 3 clubs in order of preference. You can try your clubs for the first 2 weeks only. During this time, you may change your club if it no longer suits you. After the first 2 weeks, your club choice will be set and cannot be changed. We are pleased to introduce a new school club, the Tutoring Club, which provides additional academic support for students who may need extra help with their learning. The Tutoring Club focuses on direct instruction, reteaching key concepts, and providing personalized support based on what students are currently learning in class. Teachers will work with students in small groups or one-on-one to help strengthen essential skills and support their progress. If you have any questions, please ask your teacher.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-01-15T08:12:44.146Z"
        }
      ]
    }
  ]
}