{
  "generatedAt": "2026-02-05T15:14:27.906Z",
  "day": "2026-01-27",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-01-27",
          "title": "Upcoming Tests Wednesday Wednesday January 28th - Topic 4 Test - Climate Monday February 2nd - Chapter 4 test - Gover…",
          "details": "Upcoming Tests Wednesday Wednesday January 28th - Topic 4 Test - Climate Monday February 2nd - Chapter 4 test - Government, Landmarks and Symbols Reading Complete the defintion paper (WEDNESDAY) Read and complete the AR quizzes for your library book! Tomorrow at library time I will be checking the main character, setting and plot for your literary fair project. Please watch the video of this weeks story. https://www.youtube.com/watch?v=rGX67yYNsJk Prepare for the spelling test next Friday remember patience figured temper complain mayor evacuate brave hurricanes sandbags attic hatchet thunder drizzle flooded swallowing signal levees whooped interstate I will be giving grades for the readworks participation. Please log in and complete the reading passages. Please make sure students log in to ReadWorks and complete the assigned stories. New passages have been added, including one on the Titanic and another on the three branches of government, which link closely to our class learning. Students should also read their library books and complete the AR quizzes once finished. ReadWorks login: www.readworks.org/student Class code: YU6GQ2 Password: [REDACTED] (unless already changed) Literary Fair I have already checked some of the plots and given feedback. If I have not checked yours yet, I need it ready tomorrow. Please also make sure your main characters and setting are ready to go on the board. Your artwork came back and looks great. Some of you wanted to finish more at home, so please keep working on it and bring it in this week so we can stick it on the board. Finally, start thinking about the art theme for the rest of your board. Math Complete Additional Practice 9-3 student book and homework book. I have added new Khan Academy lessons related to data. Please try to have your child practise a little Khan Academy maths each night using https://www.khanacademy.org/join/VK6QDS9E as this will help strengthen their overall maths skills. I have noticed that some students are not logging in or completing any work yet. It is important that they try to log in regularly and complete some activities so they can continue to improve their maths. Science Prepare for the topic 4 test Climate Pages 126-165 This blooket will also help you prepare for the test https://play.blooket.com/play?hwId=6970529c7a98935214a111a5 Social Studies 177 - 180 Assessment pages in the Social Studies Book! (Tomorrow) Language Arts Grammar workshop 122-123 (Thursday) Chinese Complete the worksheet given in class today! Login and practice on the Chinese website. Korean 42-47",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-01-27T06:32:03.801Z"
        }
      ]
    }
  ]
}