{
  "generatedAt": "2026-02-05T15:07:52.004Z",
  "day": "2026-01-30",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-01-30",
          "title": "Upcoming Tests Monday February 2nd - Chapter 4 test - Government, Landmarks and Symbols Thursday February 5th - Topic…",
          "details": "Upcoming Tests Monday February 2nd - Chapter 4 test - Government, Landmarks and Symbols Thursday February 5th - Topic 9 test Reading Complete all pages of the workbook up until 26. Read and complete the AR quizzes for your library book! Please watch the video of this weeks story. https://www.youtube.com/watch?v=KBOtCcC-MAg Prepare for the spelling test next Friday wit conquer brink intend fury chill patterns actual vibrant fortunate I will be giving grades for the readworks participation. Please log in and complete the reading passages. Please make sure students log in to ReadWorks and complete the assigned stories. New passages have been added that link closely to our class learning. ReadWorks login: www.readworks.org/student Class code: YU6GQ2 Password: 1234 (unless already changed) Math Complete Additional Practice 9-5 student book and homework book. I have added new Khan Academy lessons related to data. Please try to have your child practise a little Khan Academy maths each night using https://www.khanacademy.org/join/VK6QDS9E as this will help strengthen their overall maths skills. I have noticed that some students are not logging in or completing any work yet. It is important that they try to log in regularly and complete some activities so they can continue to improve their maths. Social Studies Prepare for the test on MONDAY! 1) Look over the book pages 138-180 2) Try the blooket with similar questions to the test. https://play.blooket.com/play?hwId=6979876b001f0082f3a6ce93 Language Arts Grammar Workshop - Pages 124-125 1 More journal Journal Writing Reminder Some students are making the same mistakes each week, so please read this carefully before writing your next journal. Make sure you write in the past tense. Journals are about things that already happened. Your journal needs a clear beginning, middle, and ending. Think about what happened first, next, and last. Write slowly and clearly so your writing is neat and easy to read. Try to make your journal more exciting for the reader. Use sensory words to describe what you saw, heard, smelled, tasted, or felt. Add details, describing words, humor, and creativity to bring your story to life. Below is an example journal you can use as a model. Last weekend was very busy and fun. On Saturday morning, I went to the dentist. The chair was uncomfortable, and I could hear strange buzzing sounds, which made me a little nervous. After that, I felt relieved it was finished. Later that day, I took my son to a bookstore in Seoul. The store was bright and quiet, and it smelled like new books. We walked around the shelves, flipping through colorful covers and talking about which books looked interesting. On Sunday, we went to a local kids café called Jumping Monster. It was loud, energetic, and full of laughter. Even though I am the father, I like to play too. I played Nintendo badminton, a fast car racing game, and even sang in the singing room. By the end of the day, I was tired but happy, and it was a weekend I really enjoyed. Science Lifecyles Watch the videos to gain understanding of the next topic! Frogs https://www.youtube.com/watch?v=F3ElGMVU6SY Humans https://www.youtube.com/watch?v=2vUPhZUofco Butterflies https://www.youtube.com/watch?v=3kZD6rlSLUw Chinese Complete the worksheet given in class today! Login and practice on the Chinese website. Korean 42-47 Spanish Write the numbers in Spanish and their favorite thing.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-01-30T05:04:34.038Z"
        }
      ]
    }
  ]
}