{
  "generatedAt": "2026-02-05T15:07:52.002Z",
  "day": "2026-01-22",
  "groups": [
    {
      "name": "3-1 Mr. Smith 25/26",
      "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
      "items": [
        {
          "id": "ann-day:794983481366:2026-01-22",
          "title": "Upcoming Tests Friday January 23rd - Vocabulary Workshop Unit 1-9 Monday February 2nd - Chapter 4 test - Government, …",
          "details": "Upcoming Tests Friday January 23rd - Vocabulary Workshop Unit 1-9 Monday February 2nd - Chapter 4 test - Government, Landmarks and Symbols Wednesday - January 28th - Topic 4 Test - Climate/ Reading Complete the Settting and Main Character part for your literary fair book on the paper I gave you or your own paper of the same size. (Friday) Please watch the video of this weeks story. https://www.youtube.com/watch?v=c1ltLnSAaT4 Prepare for the spelling test next Friday abandon appeared enormous Interfered stationary harbor voyage boarded cabin cramped bunks decks stewards unsinkable maze sobbing terrified creaking lifeboats passengers I will be checking READWORKS TOMORROW MORNING! Log in and complete the activities. Please make sure students log in to ReadWorks and complete the assigned stories. New passages have been added, including one on the Titanic and another on the three branches of government, which link closely to our class learning. Students should also read their library books and complete the AR quizzes once finished. ReadWorks login: www.readworks.org/student Class code: YU6GQ2 Password: 1234 (unless already changed) Math Great job completing your math test. I have added New Khan Academy lessons related to data. Please have your child practice a little Khan Academy math each night at https://www.khanacademy.org/join/VK6QDS9E to help strengthen their skills. Science Read and complete 152-159 This blooket will help you prepare for the test https://play.blooket.com/play?hwId=6970529c7a98935214a111a5 Literary Fair Poster Project You will use a presentation board to show your understanding of your book in a clear, creative, and visual way. Your work should be neat, colourful, well organised, and easy to read. Centre of the Board Place the picture you drew in art class in the centre. It should show an important scene, character, or idea from your book. Under the picture, include the book title, author, publisher, and publication date. This information should be centred and easy to read. Left Side of the Board Include: Main characters (with names and pictures) Setting (where and when the story takes place, with pictures) Plot (a short summary of the story) Label each section clearly. Typed work is allowed, but the font must be large enough to read from a distance. Right Side of the Board Include: The problem The solution Author’s purpose Why I liked the book Five key words with short explanations All sections must be clearly labelled and neatly organised. Theme and Design Choose a theme that matches your book and use it across the whole board. Use colours, borders, shapes, and images to make your poster eye catching and professional. Pictures and Graphics Include pictures for the main characters and the setting. These may be drawn or printed. Your board should be highly visual, not just text. Your goal is to create a creative, graphic, and high quality poster.",
          "link": "https://classroom.google.com/c/Nzk0OTgzNDgxMzY2",
          "dueAt": null,
          "topic": "ANNOUNCEMENT",
          "createdAt": "2026-01-22T06:49:45.799Z"
        }
      ]
    }
  ]
}